#######################################################
#                                                     
#  Innovus Command Logging File                     
#  Created on Sat May 25 17:18:44 2024                
#                                                     
#######################################################

#@(#)CDS: Innovus v16.20-p002_1 (64bit) 11/08/2016 11:31 (Linux 2.6.18-194.el5)
#@(#)CDS: NanoRoute 16.20-p002_1 NR161103-1425/16_20-UB (database version 2.30, 354.6.1) {superthreading v1.34}
#@(#)CDS: AAE 16.20-p004 (64bit) 11/08/2016 (Linux 2.6.18-194.el5)
#@(#)CDS: CTE 16.20-p008_1 () Oct 29 2016 08:26:57 ( )
#@(#)CDS: SYNTECH 16.20-p001_1 () Oct 27 2016 11:33:00 ( )
#@(#)CDS: CPE v16.20-p011
#@(#)CDS: IQRC/TQRC 15.2.5-s803 (64bit) Tue Sep 13 18:23:58 PDT 2016 (Linux 2.6.18-194.el5)

set_global _enable_mmmc_by_default_flow      $CTE::mmmc_default
suppressMessage ENCEXT-2799
getDrawView
loadWorkspace -name Physical
win
set init_gnd_net VSS
set init_lef_file /vol/ece303/genus_tutorial/NangateOpenCellLibrary.lef
set init_verilog ../synth/Top_mapped.v
set init_mmmc_file ../key_generation.view
set init_pwr_net VDD
init_design
setDesignMode -process 45
fit
setDrawView fplan
getIoFlowFlag
floorPlan -r 1.0 0.33 2 2 2 2
uiSetTool select
getIoFlowFlag
globalNetConnect VDD -type pgpin -pin VDD -inst *
globalNetConnect VSS -type pgpin -pin VSS -inst *
globalNetConnect VDD -type tiehi
globalNetConnect VSS -type tielo
getPinAssignMode -pinEditInBatch -quiet
setPinAssignMode -pinEditInBatch true
editPin -fixOverlap 1 -unit MICRON -spreadDirection clockwise -side Right -layer 3 -spreadType center -spacing 0.56 -pin {{addr_rd_out[0]} {addr_rd_out[1]} {addr_rd_out[2]} {addr_rd_out[3]} {addr_rd_out[4]} {addr_rd_out[5]} {addr_rd_out[6]} {addr_rd_out[7]} {addr_rd_out[8]} {addr_rd_out[9]} {addr_rd_out[10]} {addr_rd_out[11]} {addr_rd_out[12]} {addr_rd_out[13]} {addr_rd_out[14]} {addr_rd_out[15]} {addr_rd_out[16]} {addr_rd_out[17]} {addr_rd_out[18]} {addr_rd_out[19]} {addr_rd_out[20]} {addr_rd_out[21]} {addr_rd_out[22]} {addr_rd_out[23]} {addr_rd_out[24]} {addr_rd_out[25]} {addr_rd_out[26]} {addr_rd_out[27]} {addr_rd_out[28]} {addr_rd_out[29]} {addr_rd_out[30]} {addr_rd_out[31]} {addr_rd_out[32]} {addr_rd_out[33]} {addr_rd_out[34]} {addr_rd_out[35]} {addr_rd_out[36]} {addr_rd_out[37]} {addr_rd_out[38]} {addr_rd_out[39]} {addr_rd_out[40]} {addr_rd_out[41]} {addr_rd_out[42]} {addr_rd_out[43]} {addr_rd_out[44]} {addr_rd_out[45]} {addr_rd_out[46]} {addr_rd_out[47]} {addr_rd_out[48]} {addr_rd_out[49]} {addr_rd_out[50]} {addr_rd_out[51]} {addr_rd_out[52]} {addr_rd_out[53]} {addr_rd_out[54]} {addr_rd_out[55]} {addr_rd_out[56]} {addr_rd_out[57]} {addr_rd_out[58]} {addr_rd_out[59]} {addr_rd_out[60]} {addr_rd_out[61]} {addr_rd_out[62]} {addr_rd_out[63]}}
setPinAssignMode -pinEditInBatch true
editPin -pinWidth 0.07 -pinDepth 0.07 -fixOverlap 1 -unit MICRON -spreadDirection clockwise -side Right -layer 3 -spreadType center -spacing 0.56 -pin {{addr_rd_out[0]} {addr_rd_out[1]} {addr_rd_out[2]} {addr_rd_out[3]} {addr_rd_out[4]} {addr_rd_out[5]} {addr_rd_out[6]} {addr_rd_out[7]} {addr_rd_out[8]} {addr_rd_out[9]} {addr_rd_out[10]} {addr_rd_out[11]} {addr_rd_out[12]} {addr_rd_out[13]} {addr_rd_out[14]} {addr_rd_out[15]} {addr_rd_out[16]} {addr_rd_out[17]} {addr_rd_out[18]} {addr_rd_out[19]} {addr_rd_out[20]} {addr_rd_out[21]} {addr_rd_out[22]} {addr_rd_out[23]} {addr_rd_out[24]} {addr_rd_out[25]} {addr_rd_out[26]} {addr_rd_out[27]} {addr_rd_out[28]} {addr_rd_out[29]} {addr_rd_out[30]} {addr_rd_out[31]} {addr_rd_out[32]} {addr_rd_out[33]} {addr_rd_out[34]} {addr_rd_out[35]} {addr_rd_out[36]} {addr_rd_out[37]} {addr_rd_out[38]} {addr_rd_out[39]} {addr_rd_out[40]} {addr_rd_out[41]} {addr_rd_out[42]} {addr_rd_out[43]} {addr_rd_out[44]} {addr_rd_out[45]} {addr_rd_out[46]} {addr_rd_out[47]} {addr_rd_out[48]} {addr_rd_out[49]} {addr_rd_out[50]} {addr_rd_out[51]} {addr_rd_out[52]} {addr_rd_out[53]} {addr_rd_out[54]} {addr_rd_out[55]} {addr_rd_out[56]} {addr_rd_out[57]} {addr_rd_out[58]} {addr_rd_out[59]} {addr_rd_out[60]} {addr_rd_out[61]} {addr_rd_out[62]} {addr_rd_out[63]}}
setPinAssignMode -pinEditInBatch true
editPin -pinWidth 0.07 -pinDepth 0.07 -fixOverlap 1 -unit MICRON -spreadDirection clockwise -side Right -layer 3 -spreadType center -spacing 0.56 -pin {{addr_rd_out[0]} {addr_rd_out[1]} {addr_rd_out[2]} {addr_rd_out[3]} {addr_rd_out[4]} {addr_rd_out[5]} {addr_rd_out[6]} {addr_rd_out[7]} {addr_rd_out[8]} {addr_rd_out[9]} {addr_rd_out[10]} {addr_rd_out[11]} {addr_rd_out[12]} {addr_rd_out[13]} {addr_rd_out[14]} {addr_rd_out[15]} {addr_rd_out[16]} {addr_rd_out[17]} {addr_rd_out[18]} {addr_rd_out[19]} {addr_rd_out[20]} {addr_rd_out[21]} {addr_rd_out[22]} {addr_rd_out[23]} {addr_rd_out[24]} {addr_rd_out[25]} {addr_rd_out[26]} {addr_rd_out[27]} {addr_rd_out[28]} {addr_rd_out[29]} {addr_rd_out[30]} {addr_rd_out[31]} {addr_rd_out[32]} {addr_rd_out[33]} {addr_rd_out[34]} {addr_rd_out[35]} {addr_rd_out[36]} {addr_rd_out[37]} {addr_rd_out[38]} {addr_rd_out[39]} {addr_rd_out[40]} {addr_rd_out[41]} {addr_rd_out[42]} {addr_rd_out[43]} {addr_rd_out[44]} {addr_rd_out[45]} {addr_rd_out[46]} {addr_rd_out[47]} {addr_rd_out[48]} {addr_rd_out[49]} {addr_rd_out[50]} {addr_rd_out[51]} {addr_rd_out[52]} {addr_rd_out[53]} {addr_rd_out[54]} {addr_rd_out[55]} {addr_rd_out[56]} {addr_rd_out[57]} {addr_rd_out[58]} {addr_rd_out[59]} {addr_rd_out[60]} {addr_rd_out[61]} {addr_rd_out[62]} {addr_rd_out[63]}}
setPinAssignMode -pinEditInBatch true
editPin -pinWidth 0.07 -pinDepth 0.07 -fixOverlap 1 -unit MICRON -spreadDirection clockwise -side Right -layer 3 -spreadType center -spacing 0.56 -pin {{addr_rd_out[0]} {addr_rd_out[1]} {addr_rd_out[2]} {addr_rd_out[3]} {addr_rd_out[4]} {addr_rd_out[5]} {addr_rd_out[6]} {addr_rd_out[7]} {addr_rd_out[8]} {addr_rd_out[9]} {addr_rd_out[10]} {addr_rd_out[11]} {addr_rd_out[12]} {addr_rd_out[13]} {addr_rd_out[14]} {addr_rd_out[15]} {addr_rd_out[16]} {addr_rd_out[17]} {addr_rd_out[18]} {addr_rd_out[19]} {addr_rd_out[20]} {addr_rd_out[21]} {addr_rd_out[22]} {addr_rd_out[23]} {addr_rd_out[24]} {addr_rd_out[25]} {addr_rd_out[26]} {addr_rd_out[27]} {addr_rd_out[28]} {addr_rd_out[29]} {addr_rd_out[30]} {addr_rd_out[31]} {addr_rd_out[32]} {addr_rd_out[33]} {addr_rd_out[34]} {addr_rd_out[35]} {addr_rd_out[36]} {addr_rd_out[37]} {addr_rd_out[38]} {addr_rd_out[39]} {addr_rd_out[40]} {addr_rd_out[41]} {addr_rd_out[42]} {addr_rd_out[43]} {addr_rd_out[44]} {addr_rd_out[45]} {addr_rd_out[46]} {addr_rd_out[47]} {addr_rd_out[48]} {addr_rd_out[49]} {addr_rd_out[50]} {addr_rd_out[51]} {addr_rd_out[52]} {addr_rd_out[53]} {addr_rd_out[54]} {addr_rd_out[55]} {addr_rd_out[56]} {addr_rd_out[57]} {addr_rd_out[58]} {addr_rd_out[59]} {addr_rd_out[60]} {addr_rd_out[61]} {addr_rd_out[62]} {addr_rd_out[63]}}
setPinAssignMode -pinEditInBatch true
editPin -pinWidth 0.07 -pinDepth 0.07 -fixOverlap 1 -unit MICRON -spreadDirection clockwise -side Right -layer 3 -spreadType center -spacing 0.56 -pin {{addr_rd_out[0]} {addr_rd_out[1]} {addr_rd_out[2]} {addr_rd_out[3]} {addr_rd_out[4]} {addr_rd_out[5]} {addr_rd_out[6]} {addr_rd_out[7]} {addr_rd_out[8]} {addr_rd_out[9]} {addr_rd_out[10]} {addr_rd_out[11]} {addr_rd_out[12]} {addr_rd_out[13]} {addr_rd_out[14]} {addr_rd_out[15]} {addr_rd_out[16]} {addr_rd_out[17]} {addr_rd_out[18]} {addr_rd_out[19]} {addr_rd_out[20]} {addr_rd_out[21]} {addr_rd_out[22]} {addr_rd_out[23]} {addr_rd_out[24]} {addr_rd_out[25]} {addr_rd_out[26]} {addr_rd_out[27]} {addr_rd_out[28]} {addr_rd_out[29]} {addr_rd_out[30]} {addr_rd_out[31]} {addr_rd_out[32]} {addr_rd_out[33]} {addr_rd_out[34]} {addr_rd_out[35]} {addr_rd_out[36]} {addr_rd_out[37]} {addr_rd_out[38]} {addr_rd_out[39]} {addr_rd_out[40]} {addr_rd_out[41]} {addr_rd_out[42]} {addr_rd_out[43]} {addr_rd_out[44]} {addr_rd_out[45]} {addr_rd_out[46]} {addr_rd_out[47]} {addr_rd_out[48]} {addr_rd_out[49]} {addr_rd_out[50]} {addr_rd_out[51]} {addr_rd_out[52]} {addr_rd_out[53]} {addr_rd_out[54]} {addr_rd_out[55]} {addr_rd_out[56]} {addr_rd_out[57]} {addr_rd_out[58]} {addr_rd_out[59]} {addr_rd_out[60]} {addr_rd_out[61]} {addr_rd_out[62]} {addr_rd_out[63]}}
pan -337.716 -38.397
pan 126.477 27.000
setPinAssignMode -pinEditInBatch true
editPin -fixOverlap 1 -unit MICRON -spreadDirection clockwise -side Left -layer 3 -spreadType center -spacing -0.56 -pin {{addr_wr_out[0]} {addr_wr_out[1]} {addr_wr_out[2]} {addr_wr_out[3]} {addr_wr_out[4]} {addr_wr_out[5]} {addr_wr_out[6]} {addr_wr_out[7]} {addr_wr_out[8]} {addr_wr_out[9]} {addr_wr_out[10]} {addr_wr_out[11]} {addr_wr_out[12]} {addr_wr_out[13]} {addr_wr_out[14]} {addr_wr_out[15]} {addr_wr_out[16]} {addr_wr_out[17]} {addr_wr_out[18]} {addr_wr_out[19]} {addr_wr_out[20]} {addr_wr_out[21]} {addr_wr_out[22]} {addr_wr_out[23]} {addr_wr_out[24]} {addr_wr_out[25]} {addr_wr_out[26]} {addr_wr_out[27]} {addr_wr_out[28]} {addr_wr_out[29]} {addr_wr_out[30]} {addr_wr_out[31]} {addr_wr_out[32]} {addr_wr_out[33]} {addr_wr_out[34]} {addr_wr_out[35]} {addr_wr_out[36]} {addr_wr_out[37]} {addr_wr_out[38]} {addr_wr_out[39]} {addr_wr_out[40]} {addr_wr_out[41]} {addr_wr_out[42]} {addr_wr_out[43]} {addr_wr_out[44]} {addr_wr_out[45]} {addr_wr_out[46]} {addr_wr_out[47]} {addr_wr_out[48]} {addr_wr_out[49]} {addr_wr_out[50]} {addr_wr_out[51]} {addr_wr_out[52]} {addr_wr_out[53]} {addr_wr_out[54]} {addr_wr_out[55]} {addr_wr_out[56]} {addr_wr_out[57]} {addr_wr_out[58]} {addr_wr_out[59]} {addr_wr_out[60]} {addr_wr_out[61]} {addr_wr_out[62]} {addr_wr_out[63]}}
set ptngSprNoRefreshPins 1
setPtnPinStatus -cell key_generation -pin {addr_wr_out[0]} -status unplaced -silent
setPtnPinStatus -cell key_generation -pin {addr_wr_out[1]} -status unplaced -silent
setPtnPinStatus -cell key_generation -pin {addr_wr_out[2]} -status unplaced -silent
setPtnPinStatus -cell key_generation -pin {addr_wr_out[3]} -status unplaced -silent
setPtnPinStatus -cell key_generation -pin {addr_wr_out[4]} -status unplaced -silent
setPtnPinStatus -cell key_generation -pin {addr_wr_out[5]} -status unplaced -silent
setPtnPinStatus -cell key_generation -pin {addr_wr_out[6]} -status unplaced -silent
setPtnPinStatus -cell key_generation -pin {addr_wr_out[7]} -status unplaced -silent
setPtnPinStatus -cell key_generation -pin {addr_wr_out[8]} -status unplaced -silent
setPtnPinStatus -cell key_generation -pin {addr_wr_out[9]} -status unplaced -silent
setPtnPinStatus -cell key_generation -pin {addr_wr_out[10]} -status unplaced -silent
setPtnPinStatus -cell key_generation -pin {addr_wr_out[11]} -status unplaced -silent
setPtnPinStatus -cell key_generation -pin {addr_wr_out[12]} -status unplaced -silent
setPtnPinStatus -cell key_generation -pin {addr_wr_out[13]} -status unplaced -silent
setPtnPinStatus -cell key_generation -pin {addr_wr_out[14]} -status unplaced -silent
setPtnPinStatus -cell key_generation -pin {addr_wr_out[15]} -status unplaced -silent
setPtnPinStatus -cell key_generation -pin {addr_wr_out[16]} -status unplaced -silent
setPtnPinStatus -cell key_generation -pin {addr_wr_out[17]} -status unplaced -silent
setPtnPinStatus -cell key_generation -pin {addr_wr_out[18]} -status unplaced -silent
setPtnPinStatus -cell key_generation -pin {addr_wr_out[19]} -status unplaced -silent
setPtnPinStatus -cell key_generation -pin {addr_wr_out[20]} -status unplaced -silent
setPtnPinStatus -cell key_generation -pin {addr_wr_out[21]} -status unplaced -silent
setPtnPinStatus -cell key_generation -pin {addr_wr_out[22]} -status unplaced -silent
setPtnPinStatus -cell key_generation -pin {addr_wr_out[23]} -status unplaced -silent
setPtnPinStatus -cell key_generation -pin {addr_wr_out[24]} -status unplaced -silent
setPtnPinStatus -cell key_generation -pin {addr_wr_out[25]} -status unplaced -silent
setPtnPinStatus -cell key_generation -pin {addr_wr_out[26]} -status unplaced -silent
setPtnPinStatus -cell key_generation -pin {addr_wr_out[27]} -status unplaced -silent
setPtnPinStatus -cell key_generation -pin {addr_wr_out[28]} -status unplaced -silent
setPtnPinStatus -cell key_generation -pin {addr_wr_out[29]} -status unplaced -silent
setPtnPinStatus -cell key_generation -pin {addr_wr_out[30]} -status unplaced -silent
setPtnPinStatus -cell key_generation -pin {addr_wr_out[31]} -status unplaced -silent
setPtnPinStatus -cell key_generation -pin {addr_wr_out[32]} -status unplaced -silent
setPtnPinStatus -cell key_generation -pin {addr_wr_out[33]} -status unplaced -silent
setPtnPinStatus -cell key_generation -pin {addr_wr_out[34]} -status unplaced -silent
setPtnPinStatus -cell key_generation -pin {addr_wr_out[35]} -status unplaced -silent
setPtnPinStatus -cell key_generation -pin {addr_wr_out[36]} -status unplaced -silent
setPtnPinStatus -cell key_generation -pin {addr_wr_out[37]} -status unplaced -silent
setPtnPinStatus -cell key_generation -pin {addr_wr_out[38]} -status unplaced -silent
setPtnPinStatus -cell key_generation -pin {addr_wr_out[39]} -status unplaced -silent
setPtnPinStatus -cell key_generation -pin {addr_wr_out[40]} -status unplaced -silent
setPtnPinStatus -cell key_generation -pin {addr_wr_out[41]} -status unplaced -silent
setPtnPinStatus -cell key_generation -pin {addr_wr_out[42]} -status unplaced -silent
setPtnPinStatus -cell key_generation -pin {addr_wr_out[43]} -status unplaced -silent
setPtnPinStatus -cell key_generation -pin {addr_wr_out[44]} -status unplaced -silent
setPtnPinStatus -cell key_generation -pin {addr_wr_out[45]} -status unplaced -silent
setPtnPinStatus -cell key_generation -pin {addr_wr_out[46]} -status unplaced -silent
setPtnPinStatus -cell key_generation -pin {addr_wr_out[47]} -status unplaced -silent
setPtnPinStatus -cell key_generation -pin {addr_wr_out[48]} -status unplaced -silent
setPtnPinStatus -cell key_generation -pin {addr_wr_out[49]} -status unplaced -silent
setPtnPinStatus -cell key_generation -pin {addr_wr_out[50]} -status unplaced -silent
setPtnPinStatus -cell key_generation -pin {addr_wr_out[51]} -status unplaced -silent
setPtnPinStatus -cell key_generation -pin {addr_wr_out[52]} -status unplaced -silent
setPtnPinStatus -cell key_generation -pin {addr_wr_out[53]} -status unplaced -silent
setPtnPinStatus -cell key_generation -pin {addr_wr_out[54]} -status unplaced -silent
setPtnPinStatus -cell key_generation -pin {addr_wr_out[55]} -status unplaced -silent
setPtnPinStatus -cell key_generation -pin {addr_wr_out[56]} -status unplaced -silent
setPtnPinStatus -cell key_generation -pin {addr_wr_out[57]} -status unplaced -silent
setPtnPinStatus -cell key_generation -pin {addr_wr_out[58]} -status unplaced -silent
setPtnPinStatus -cell key_generation -pin {addr_wr_out[59]} -status unplaced -silent
setPtnPinStatus -cell key_generation -pin {addr_wr_out[60]} -status unplaced -silent
setPtnPinStatus -cell key_generation -pin {addr_wr_out[61]} -status unplaced -silent
setPtnPinStatus -cell key_generation -pin {addr_wr_out[62]} -status unplaced -silent
setPtnPinStatus -cell key_generation -pin {addr_wr_out[63]} -status unplaced -silent
set ptngSprNoRefreshPins 0
ptnSprRefreshPinsAndBlockages
setPinAssignMode -pinEditInBatch true
editPin -fixOverlap 1 -unit MICRON -spreadDirection clockwise -side Left -layer 3 -spreadType center -spacing 0.56 -pin {{addr_wr_out[0]} {addr_wr_out[1]} {addr_wr_out[2]} {addr_wr_out[3]} {addr_wr_out[4]} {addr_wr_out[5]} {addr_wr_out[6]} {addr_wr_out[7]} {addr_wr_out[8]} {addr_wr_out[9]} {addr_wr_out[10]} {addr_wr_out[11]} {addr_wr_out[12]} {addr_wr_out[13]} {addr_wr_out[14]} {addr_wr_out[15]} {addr_wr_out[16]} {addr_wr_out[17]} {addr_wr_out[18]} {addr_wr_out[19]} {addr_wr_out[20]} {addr_wr_out[21]} {addr_wr_out[22]} {addr_wr_out[23]} {addr_wr_out[24]} {addr_wr_out[25]} {addr_wr_out[26]} {addr_wr_out[27]} {addr_wr_out[28]} {addr_wr_out[29]} {addr_wr_out[30]} {addr_wr_out[31]} {addr_wr_out[32]} {addr_wr_out[33]} {addr_wr_out[34]} {addr_wr_out[35]} {addr_wr_out[36]} {addr_wr_out[37]} {addr_wr_out[38]} {addr_wr_out[39]} {addr_wr_out[40]} {addr_wr_out[41]} {addr_wr_out[42]} {addr_wr_out[43]} {addr_wr_out[44]} {addr_wr_out[45]} {addr_wr_out[46]} {addr_wr_out[47]} {addr_wr_out[48]} {addr_wr_out[49]} {addr_wr_out[50]} {addr_wr_out[51]} {addr_wr_out[52]} {addr_wr_out[53]} {addr_wr_out[54]} {addr_wr_out[55]} {addr_wr_out[56]} {addr_wr_out[57]} {addr_wr_out[58]} {addr_wr_out[59]} {addr_wr_out[60]} {addr_wr_out[61]} {addr_wr_out[62]} {addr_wr_out[63]}}
pan 314.325 -25.079
pan -86.404 7.855
setPinAssignMode -pinEditInBatch true
editPin -fixOverlap 1 -unit MICRON -spreadDirection clockwise -side Left -layer 3 -spreadType center -spacing 0.14 -pin mem_wr_en
setPinAssignMode -pinEditInBatch true
editPin -fixOverlap 1 -unit MICRON -spreadDirection clockwise -side Top -layer 5 -spreadType center -spacing 0.14 -pin {clk done start rst}
setPinAssignMode -pinEditInBatch true
editPin -use CLOCK -pinWidth 0.14 -pinDepth 0.14 -fixOverlap 1 -unit MICRON -spreadDirection clockwise -side Top -layer 5 -spreadType center -spacing 0.28 -pin clk
setPinAssignMode -pinEditInBatch true
editPin -fixOverlap 1 -unit MICRON -spreadDirection clockwise -side Bottom -layer 4 -spreadType center -spacing 0.14 -pin {{g_out[0]} {g_out[1]} {g_out[2]} {g_out[3]} {g_out[4]} {g_out[5]} {g_out[6]} {g_out[7]} {g_out[8]} {g_out[9]} {g_out[10]} {g_out[11]} {g_out[12]} {g_out[13]} {g_out[14]} {g_out[15]} {g_out[16]} {g_out[17]} {g_out[18]} {g_out[19]} {g_out[20]} {g_out[21]} {g_out[22]} {g_out[23]} {g_out[24]} {g_out[25]} {g_out[26]} {g_out[27]} {g_out[28]} {g_out[29]} {g_out[30]} {g_out[31]} {g_out[32]} {g_out[33]} {g_out[34]} {g_out[35]} {g_out[36]} {g_out[37]} {g_out[38]} {g_out[39]} {g_out[40]} {g_out[41]} {g_out[42]} {g_out[43]} {g_out[44]} {g_out[45]} {g_out[46]} {g_out[47]} {g_out[48]} {g_out[49]} {g_out[50]} {g_out[51]} {g_out[52]} {g_out[53]} {g_out[54]} {g_out[55]} {g_out[56]} {g_out[57]} {g_out[58]} {g_out[59]} {g_out[60]} {g_out[61]} {g_out[62]} {g_out[63]} {g_out[64]} {g_out[65]} {g_out[66]} {g_out[67]} {g_out[68]} {g_out[69]} {g_out[70]} {g_out[71]} {g_out[72]} {g_out[73]} {g_out[74]} {g_out[75]} {g_out[76]} {g_out[77]} {g_out[78]} {g_out[79]} {g_out[80]} {g_out[81]} {g_out[82]} {g_out[83]} {g_out[84]} {g_out[85]} {g_out[86]} {g_out[87]} {g_out[88]} {g_out[89]} {g_out[90]} {g_out[91]} {g_out[92]} {g_out[93]} {g_out[94]} {g_out[95]} {g_out[96]} {g_out[97]} {g_out[98]} {g_out[99]} {g_out[100]} {g_out[101]} {g_out[102]} {g_out[103]} {g_out[104]} {g_out[105]} {g_out[106]} {g_out[107]} {g_out[108]} {g_out[109]} {g_out[110]} {g_out[111]} {g_out[112]} {g_out[113]} {g_out[114]} {g_out[115]} {g_out[116]} {g_out[117]} {g_out[118]} {g_out[119]} {g_out[120]} {g_out[121]} {g_out[122]} {g_out[123]} {g_out[124]} {g_out[125]} {g_out[126]} {g_out[127]} {lambda_out[0]} {lambda_out[1]} {lambda_out[2]} {lambda_out[3]} {lambda_out[4]} {lambda_out[5]} {lambda_out[6]} {lambda_out[7]} {lambda_out[8]} {lambda_out[9]} {lambda_out[10]} {lambda_out[11]} {lambda_out[12]} {lambda_out[13]} {lambda_out[14]} {lambda_out[15]} {lambda_out[16]} {lambda_out[17]} {lambda_out[18]} {lambda_out[19]} {lambda_out[20]} {lambda_out[21]} {lambda_out[22]} {lambda_out[23]} {lambda_out[24]} {lambda_out[25]} {lambda_out[26]} {lambda_out[27]} {lambda_out[28]} {lambda_out[29]} {lambda_out[30]} {lambda_out[31]} {lambda_out[32]} {lambda_out[33]} {lambda_out[34]} {lambda_out[35]} {lambda_out[36]} {lambda_out[37]} {lambda_out[38]} {lambda_out[39]} {lambda_out[40]} {lambda_out[41]} {lambda_out[42]} {lambda_out[43]} {lambda_out[44]} {lambda_out[45]} {lambda_out[46]} {lambda_out[47]} {lambda_out[48]} {lambda_out[49]} {lambda_out[50]} {lambda_out[51]} {lambda_out[52]} {lambda_out[53]} {lambda_out[54]} {lambda_out[55]} {lambda_out[56]} {lambda_out[57]} {lambda_out[58]} {lambda_out[59]} {lambda_out[60]} {lambda_out[61]} {lambda_out[62]} {lambda_out[63]} {lambda_out[64]} {lambda_out[65]} {lambda_out[66]} {lambda_out[67]} {lambda_out[68]} {lambda_out[69]} {lambda_out[70]} {lambda_out[71]} {lambda_out[72]} {lambda_out[73]} {lambda_out[74]} {lambda_out[75]} {lambda_out[76]} {lambda_out[77]} {lambda_out[78]} {lambda_out[79]} {lambda_out[80]} {lambda_out[81]} {lambda_out[82]} {lambda_out[83]} {lambda_out[84]} {lambda_out[85]} {lambda_out[86]} {lambda_out[87]} {lambda_out[88]} {lambda_out[89]} {lambda_out[90]} {lambda_out[91]} {lambda_out[92]} {lambda_out[93]} {lambda_out[94]} {lambda_out[95]} {lambda_out[96]} {lambda_out[97]} {lambda_out[98]} {lambda_out[99]} {lambda_out[100]} {lambda_out[101]} {lambda_out[102]} {lambda_out[103]} {lambda_out[104]} {lambda_out[105]} {lambda_out[106]} {lambda_out[107]} {lambda_out[108]} {lambda_out[109]} {lambda_out[110]} {lambda_out[111]} {lambda_out[112]} {lambda_out[113]} {lambda_out[114]} {lambda_out[115]} {lambda_out[116]} {lambda_out[117]} {lambda_out[118]} {lambda_out[119]} {lambda_out[120]} {lambda_out[121]} {lambda_out[122]} {lambda_out[123]} {lambda_out[124]} {lambda_out[125]} {lambda_out[126]} {lambda_out[127]}}
setPinAssignMode -pinEditInBatch true
editPin -fixOverlap 1 -unit MICRON -spreadDirection clockwise -side Top -layer 4 -spreadType center -spacing 0.14 -pin {{n_out[0]} {n_out[1]} {n_out[2]} {n_out[3]} {n_out[4]} {n_out[5]} {n_out[6]} {n_out[7]} {n_out[8]} {n_out[9]} {n_out[10]} {n_out[11]} {n_out[12]} {n_out[13]} {n_out[14]} {n_out[15]} {n_out[16]} {n_out[17]} {n_out[18]} {n_out[19]} {n_out[20]} {n_out[21]} {n_out[22]} {n_out[23]} {n_out[24]} {n_out[25]} {n_out[26]} {n_out[27]} {n_out[28]} {n_out[29]} {n_out[30]} {n_out[31]} {n_out[32]} {n_out[33]} {n_out[34]} {n_out[35]} {n_out[36]} {n_out[37]} {n_out[38]} {n_out[39]} {n_out[40]} {n_out[41]} {n_out[42]} {n_out[43]} {n_out[44]} {n_out[45]} {n_out[46]} {n_out[47]} {n_out[48]} {n_out[49]} {n_out[50]} {n_out[51]} {n_out[52]} {n_out[53]} {n_out[54]} {n_out[55]} {n_out[56]} {n_out[57]} {n_out[58]} {n_out[59]} {n_out[60]} {n_out[61]} {n_out[62]} {n_out[63]} {n_out[64]} {n_out[65]} {n_out[66]} {n_out[67]} {n_out[68]} {n_out[69]} {n_out[70]} {n_out[71]} {n_out[72]} {n_out[73]} {n_out[74]} {n_out[75]} {n_out[76]} {n_out[77]} {n_out[78]} {n_out[79]} {n_out[80]} {n_out[81]} {n_out[82]} {n_out[83]} {n_out[84]} {n_out[85]} {n_out[86]} {n_out[87]} {n_out[88]} {n_out[89]} {n_out[90]} {n_out[91]} {n_out[92]} {n_out[93]} {n_out[94]} {n_out[95]} {n_out[96]} {n_out[97]} {n_out[98]} {n_out[99]} {n_out[100]} {n_out[101]} {n_out[102]} {n_out[103]} {n_out[104]} {n_out[105]} {n_out[106]} {n_out[107]} {n_out[108]} {n_out[109]} {n_out[110]} {n_out[111]} {n_out[112]} {n_out[113]} {n_out[114]} {n_out[115]} {n_out[116]} {n_out[117]} {n_out[118]} {n_out[119]} {n_out[120]} {n_out[121]} {n_out[122]} {n_out[123]} {n_out[124]} {n_out[125]} {n_out[126]} {n_out[127]} {p[0]} {p[1]} {p[2]} {p[3]} {p[4]} {p[5]} {p[6]} {p[7]} {p[8]} {p[9]} {p[10]} {p[11]} {p[12]} {p[13]} {p[14]} {p[15]} {p[16]} {p[17]} {p[18]} {p[19]} {p[20]} {p[21]} {p[22]} {p[23]} {p[24]} {p[25]} {p[26]} {p[27]} {p[28]} {p[29]} {p[30]} {p[31]} {p[32]} {p[33]} {p[34]} {p[35]} {p[36]} {p[37]} {p[38]} {p[39]} {p[40]} {p[41]} {p[42]} {p[43]} {p[44]} {p[45]} {p[46]} {p[47]} {p[48]} {p[49]} {p[50]} {p[51]} {p[52]} {p[53]} {p[54]} {p[55]} {p[56]} {p[57]} {p[58]} {p[59]} {p[60]} {p[61]} {p[62]} {p[63]} {q[0]} {q[1]} {q[2]} {q[3]} {q[4]} {q[5]} {q[6]} {q[7]} {q[8]} {q[9]} {q[10]} {q[11]} {q[12]} {q[13]} {q[14]} {q[15]} {q[16]} {q[17]} {q[18]} {q[19]} {q[20]} {q[21]} {q[22]} {q[23]} {q[24]} {q[25]} {q[26]} {q[27]} {q[28]} {q[29]} {q[30]} {q[31]} {q[32]} {q[33]} {q[34]} {q[35]} {q[36]} {q[37]} {q[38]} {q[39]} {q[40]} {q[41]} {q[42]} {q[43]} {q[44]} {q[45]} {q[46]} {q[47]} {q[48]} {q[49]} {q[50]} {q[51]} {q[52]} {q[53]} {q[54]} {q[55]} {q[56]} {q[57]} {q[58]} {q[59]} {q[60]} {q[61]} {q[62]} {q[63]}}
pan -92.755 106.112
pan 0.000 161.766
pan -253.743 -12.083
setPinAssignMode -pinEditInBatch true
editPin -fixOverlap 1 -unit MICRON -spreadDirection clockwise -side Bottom -layer 4 -spreadType start -spacing 0.28 -start 0.0 0.0 -pin {{u_out[0]} {u_out[1]} {u_out[2]} {u_out[3]} {u_out[4]} {u_out[5]} {u_out[6]} {u_out[7]} {u_out[8]} {u_out[9]} {u_out[10]} {u_out[11]} {u_out[12]} {u_out[13]} {u_out[14]} {u_out[15]} {u_out[16]} {u_out[17]} {u_out[18]} {u_out[19]} {u_out[20]} {u_out[21]} {u_out[22]} {u_out[23]} {u_out[24]} {u_out[25]} {u_out[26]} {u_out[27]} {u_out[28]} {u_out[29]} {u_out[30]} {u_out[31]} {u_out[32]} {u_out[33]} {u_out[34]} {u_out[35]} {u_out[36]} {u_out[37]} {u_out[38]} {u_out[39]} {u_out[40]} {u_out[41]} {u_out[42]} {u_out[43]} {u_out[44]} {u_out[45]} {u_out[46]} {u_out[47]} {u_out[48]} {u_out[49]} {u_out[50]} {u_out[51]} {u_out[52]} {u_out[53]} {u_out[54]} {u_out[55]} {u_out[56]} {u_out[57]} {u_out[58]} {u_out[59]} {u_out[60]} {u_out[61]} {u_out[62]} {u_out[63]} {u_out[64]} {u_out[65]} {u_out[66]} {u_out[67]} {u_out[68]} {u_out[69]} {u_out[70]} {u_out[71]} {u_out[72]} {u_out[73]} {u_out[74]} {u_out[75]} {u_out[76]} {u_out[77]} {u_out[78]} {u_out[79]} {u_out[80]} {u_out[81]} {u_out[82]} {u_out[83]} {u_out[84]} {u_out[85]} {u_out[86]} {u_out[87]} {u_out[88]} {u_out[89]} {u_out[90]} {u_out[91]} {u_out[92]} {u_out[93]} {u_out[94]} {u_out[95]} {u_out[96]} {u_out[97]} {u_out[98]} {u_out[99]} {u_out[100]} {u_out[101]} {u_out[102]} {u_out[103]} {u_out[104]} {u_out[105]} {u_out[106]} {u_out[107]} {u_out[108]} {u_out[109]} {u_out[110]} {u_out[111]} {u_out[112]} {u_out[113]} {u_out[114]} {u_out[115]} {u_out[116]} {u_out[117]} {u_out[118]} {u_out[119]} {u_out[120]} {u_out[121]} {u_out[122]} {u_out[123]} {u_out[124]} {u_out[125]} {u_out[126]} {u_out[127]}}
setPinAssignMode -pinEditInBatch true
editPin -fixOverlap 1 -unit MICRON -spreadDirection clockwise -side Bottom -layer 1 -spreadType start -spacing 0.28 -start 0.0 0.0 -pin {{u_out[0]} {u_out[1]} {u_out[2]} {u_out[3]} {u_out[4]} {u_out[5]} {u_out[6]} {u_out[7]} {u_out[8]} {u_out[9]} {u_out[10]} {u_out[11]} {u_out[12]} {u_out[13]} {u_out[14]} {u_out[15]} {u_out[16]} {u_out[17]} {u_out[18]} {u_out[19]} {u_out[20]} {u_out[21]} {u_out[22]} {u_out[23]} {u_out[24]} {u_out[25]} {u_out[26]} {u_out[27]} {u_out[28]} {u_out[29]} {u_out[30]} {u_out[31]} {u_out[32]} {u_out[33]} {u_out[34]} {u_out[35]} {u_out[36]} {u_out[37]} {u_out[38]} {u_out[39]} {u_out[40]} {u_out[41]} {u_out[42]} {u_out[43]} {u_out[44]} {u_out[45]} {u_out[46]} {u_out[47]} {u_out[48]} {u_out[49]} {u_out[50]} {u_out[51]} {u_out[52]} {u_out[53]} {u_out[54]} {u_out[55]} {u_out[56]} {u_out[57]} {u_out[58]} {u_out[59]} {u_out[60]} {u_out[61]} {u_out[62]} {u_out[63]} {u_out[64]} {u_out[65]} {u_out[66]} {u_out[67]} {u_out[68]} {u_out[69]} {u_out[70]} {u_out[71]} {u_out[72]} {u_out[73]} {u_out[74]} {u_out[75]} {u_out[76]} {u_out[77]} {u_out[78]} {u_out[79]} {u_out[80]} {u_out[81]} {u_out[82]} {u_out[83]} {u_out[84]} {u_out[85]} {u_out[86]} {u_out[87]} {u_out[88]} {u_out[89]} {u_out[90]} {u_out[91]} {u_out[92]} {u_out[93]} {u_out[94]} {u_out[95]} {u_out[96]} {u_out[97]} {u_out[98]} {u_out[99]} {u_out[100]} {u_out[101]} {u_out[102]} {u_out[103]} {u_out[104]} {u_out[105]} {u_out[106]} {u_out[107]} {u_out[108]} {u_out[109]} {u_out[110]} {u_out[111]} {u_out[112]} {u_out[113]} {u_out[114]} {u_out[115]} {u_out[116]} {u_out[117]} {u_out[118]} {u_out[119]} {u_out[120]} {u_out[121]} {u_out[122]} {u_out[123]} {u_out[124]} {u_out[125]} {u_out[126]} {u_out[127]}}
setPinAssignMode -pinEditInBatch true
editPin -fixOverlap 1 -spreadDirection clockwise -side Bottom -layer 1 -spreadType side -pin {{u_out[0]} {u_out[1]} {u_out[2]} {u_out[3]} {u_out[4]} {u_out[5]} {u_out[6]} {u_out[7]} {u_out[8]} {u_out[9]} {u_out[10]} {u_out[11]} {u_out[12]} {u_out[13]} {u_out[14]} {u_out[15]} {u_out[16]} {u_out[17]} {u_out[18]} {u_out[19]} {u_out[20]} {u_out[21]} {u_out[22]} {u_out[23]} {u_out[24]} {u_out[25]} {u_out[26]} {u_out[27]} {u_out[28]} {u_out[29]} {u_out[30]} {u_out[31]} {u_out[32]} {u_out[33]} {u_out[34]} {u_out[35]} {u_out[36]} {u_out[37]} {u_out[38]} {u_out[39]} {u_out[40]} {u_out[41]} {u_out[42]} {u_out[43]} {u_out[44]} {u_out[45]} {u_out[46]} {u_out[47]} {u_out[48]} {u_out[49]} {u_out[50]} {u_out[51]} {u_out[52]} {u_out[53]} {u_out[54]} {u_out[55]} {u_out[56]} {u_out[57]} {u_out[58]} {u_out[59]} {u_out[60]} {u_out[61]} {u_out[62]} {u_out[63]} {u_out[64]} {u_out[65]} {u_out[66]} {u_out[67]} {u_out[68]} {u_out[69]} {u_out[70]} {u_out[71]} {u_out[72]} {u_out[73]} {u_out[74]} {u_out[75]} {u_out[76]} {u_out[77]} {u_out[78]} {u_out[79]} {u_out[80]} {u_out[81]} {u_out[82]} {u_out[83]} {u_out[84]} {u_out[85]} {u_out[86]} {u_out[87]} {u_out[88]} {u_out[89]} {u_out[90]} {u_out[91]} {u_out[92]} {u_out[93]} {u_out[94]} {u_out[95]} {u_out[96]} {u_out[97]} {u_out[98]} {u_out[99]} {u_out[100]} {u_out[101]} {u_out[102]} {u_out[103]} {u_out[104]} {u_out[105]} {u_out[106]} {u_out[107]} {u_out[108]} {u_out[109]} {u_out[110]} {u_out[111]} {u_out[112]} {u_out[113]} {u_out[114]} {u_out[115]} {u_out[116]} {u_out[117]} {u_out[118]} {u_out[119]} {u_out[120]} {u_out[121]} {u_out[122]} {u_out[123]} {u_out[124]} {u_out[125]} {u_out[126]} {u_out[127]}}
setPinAssignMode -pinEditInBatch true
editPin -pinWidth 0.07 -pinDepth 0.07 -fixOverlap 1 -spreadDirection clockwise -side Bottom -layer 4 -spreadType side -pin {{u_out[0]} {u_out[1]} {u_out[2]} {u_out[3]} {u_out[4]} {u_out[5]} {u_out[6]} {u_out[7]} {u_out[8]} {u_out[9]} {u_out[10]} {u_out[11]} {u_out[12]} {u_out[13]} {u_out[14]} {u_out[15]} {u_out[16]} {u_out[17]} {u_out[18]} {u_out[19]} {u_out[20]} {u_out[21]} {u_out[22]} {u_out[23]} {u_out[24]} {u_out[25]} {u_out[26]} {u_out[27]} {u_out[28]} {u_out[29]} {u_out[30]} {u_out[31]} {u_out[32]} {u_out[33]} {u_out[34]} {u_out[35]} {u_out[36]} {u_out[37]} {u_out[38]} {u_out[39]} {u_out[40]} {u_out[41]} {u_out[42]} {u_out[43]} {u_out[44]} {u_out[45]} {u_out[46]} {u_out[47]} {u_out[48]} {u_out[49]} {u_out[50]} {u_out[51]} {u_out[52]} {u_out[53]} {u_out[54]} {u_out[55]} {u_out[56]} {u_out[57]} {u_out[58]} {u_out[59]} {u_out[60]} {u_out[61]} {u_out[62]} {u_out[63]} {u_out[64]} {u_out[65]} {u_out[66]} {u_out[67]} {u_out[68]} {u_out[69]} {u_out[70]} {u_out[71]} {u_out[72]} {u_out[73]} {u_out[74]} {u_out[75]} {u_out[76]} {u_out[77]} {u_out[78]} {u_out[79]} {u_out[80]} {u_out[81]} {u_out[82]} {u_out[83]} {u_out[84]} {u_out[85]} {u_out[86]} {u_out[87]} {u_out[88]} {u_out[89]} {u_out[90]} {u_out[91]} {u_out[92]} {u_out[93]} {u_out[94]} {u_out[95]} {u_out[96]} {u_out[97]} {u_out[98]} {u_out[99]} {u_out[100]} {u_out[101]} {u_out[102]} {u_out[103]} {u_out[104]} {u_out[105]} {u_out[106]} {u_out[107]} {u_out[108]} {u_out[109]} {u_out[110]} {u_out[111]} {u_out[112]} {u_out[113]} {u_out[114]} {u_out[115]} {u_out[116]} {u_out[117]} {u_out[118]} {u_out[119]} {u_out[120]} {u_out[121]} {u_out[122]} {u_out[123]} {u_out[124]} {u_out[125]} {u_out[126]} {u_out[127]}}
setPinAssignMode -pinEditInBatch true
editPin -pinWidth 0.14 -pinDepth 0.14 -fixOverlap 1 -spreadDirection clockwise -side Bottom -layer 6 -spreadType side -pin {{u_out[0]} {u_out[1]} {u_out[2]} {u_out[3]} {u_out[4]} {u_out[5]} {u_out[6]} {u_out[7]} {u_out[8]} {u_out[9]} {u_out[10]} {u_out[11]} {u_out[12]} {u_out[13]} {u_out[14]} {u_out[15]} {u_out[16]} {u_out[17]} {u_out[18]} {u_out[19]} {u_out[20]} {u_out[21]} {u_out[22]} {u_out[23]} {u_out[24]} {u_out[25]} {u_out[26]} {u_out[27]} {u_out[28]} {u_out[29]} {u_out[30]} {u_out[31]} {u_out[32]} {u_out[33]} {u_out[34]} {u_out[35]} {u_out[36]} {u_out[37]} {u_out[38]} {u_out[39]} {u_out[40]} {u_out[41]} {u_out[42]} {u_out[43]} {u_out[44]} {u_out[45]} {u_out[46]} {u_out[47]} {u_out[48]} {u_out[49]} {u_out[50]} {u_out[51]} {u_out[52]} {u_out[53]} {u_out[54]} {u_out[55]} {u_out[56]} {u_out[57]} {u_out[58]} {u_out[59]} {u_out[60]} {u_out[61]} {u_out[62]} {u_out[63]} {u_out[64]} {u_out[65]} {u_out[66]} {u_out[67]} {u_out[68]} {u_out[69]} {u_out[70]} {u_out[71]} {u_out[72]} {u_out[73]} {u_out[74]} {u_out[75]} {u_out[76]} {u_out[77]} {u_out[78]} {u_out[79]} {u_out[80]} {u_out[81]} {u_out[82]} {u_out[83]} {u_out[84]} {u_out[85]} {u_out[86]} {u_out[87]} {u_out[88]} {u_out[89]} {u_out[90]} {u_out[91]} {u_out[92]} {u_out[93]} {u_out[94]} {u_out[95]} {u_out[96]} {u_out[97]} {u_out[98]} {u_out[99]} {u_out[100]} {u_out[101]} {u_out[102]} {u_out[103]} {u_out[104]} {u_out[105]} {u_out[106]} {u_out[107]} {u_out[108]} {u_out[109]} {u_out[110]} {u_out[111]} {u_out[112]} {u_out[113]} {u_out[114]} {u_out[115]} {u_out[116]} {u_out[117]} {u_out[118]} {u_out[119]} {u_out[120]} {u_out[121]} {u_out[122]} {u_out[123]} {u_out[124]} {u_out[125]} {u_out[126]} {u_out[127]}}
pan 74.613 1.415
pan 78.657 -0.607
pan -54.797 -0.607
setPinAssignMode -pinEditInBatch true
editPin -pinWidth 0.14 -pinDepth 0.14 -fixOverlap 1 -unit MICRON -spreadDirection clockwise -side Right -layer 6 -spreadType center -spacing 0.28 -pin {{u_out[0]} {u_out[1]} {u_out[2]} {u_out[3]} {u_out[4]} {u_out[5]} {u_out[6]} {u_out[7]} {u_out[8]} {u_out[9]} {u_out[10]} {u_out[11]} {u_out[12]} {u_out[13]} {u_out[14]} {u_out[15]} {u_out[16]} {u_out[17]} {u_out[18]} {u_out[19]} {u_out[20]} {u_out[21]} {u_out[22]} {u_out[23]} {u_out[24]} {u_out[25]} {u_out[26]} {u_out[27]} {u_out[28]} {u_out[29]} {u_out[30]} {u_out[31]} {u_out[32]} {u_out[33]} {u_out[34]} {u_out[35]} {u_out[36]} {u_out[37]} {u_out[38]} {u_out[39]} {u_out[40]} {u_out[41]} {u_out[42]} {u_out[43]} {u_out[44]} {u_out[45]} {u_out[46]} {u_out[47]} {u_out[48]} {u_out[49]} {u_out[50]} {u_out[51]} {u_out[52]} {u_out[53]} {u_out[54]} {u_out[55]} {u_out[56]} {u_out[57]} {u_out[58]} {u_out[59]} {u_out[60]} {u_out[61]} {u_out[62]} {u_out[63]} {u_out[64]} {u_out[65]} {u_out[66]} {u_out[67]} {u_out[68]} {u_out[69]} {u_out[70]} {u_out[71]} {u_out[72]} {u_out[73]} {u_out[74]} {u_out[75]} {u_out[76]} {u_out[77]} {u_out[78]} {u_out[79]} {u_out[80]} {u_out[81]} {u_out[82]} {u_out[83]} {u_out[84]} {u_out[85]} {u_out[86]} {u_out[87]} {u_out[88]} {u_out[89]} {u_out[90]} {u_out[91]} {u_out[92]} {u_out[93]} {u_out[94]} {u_out[95]} {u_out[96]} {u_out[97]} {u_out[98]} {u_out[99]} {u_out[100]} {u_out[101]} {u_out[102]} {u_out[103]} {u_out[104]} {u_out[105]} {u_out[106]} {u_out[107]} {u_out[108]} {u_out[109]} {u_out[110]} {u_out[111]} {u_out[112]} {u_out[113]} {u_out[114]} {u_out[115]} {u_out[116]} {u_out[117]} {u_out[118]} {u_out[119]} {u_out[120]} {u_out[121]} {u_out[122]} {u_out[123]} {u_out[124]} {u_out[125]} {u_out[126]} {u_out[127]}}
setPinAssignMode -pinEditInBatch true
editPin -pinWidth 0.14 -pinDepth 0.14 -fixOverlap 1 -unit MICRON -spreadDirection clockwise -side Right -layer 6 -spreadType center -spacing -0.28 -pin {{u_out[0]} {u_out[1]} {u_out[2]} {u_out[3]} {u_out[4]} {u_out[5]} {u_out[6]} {u_out[7]} {u_out[8]} {u_out[9]} {u_out[10]} {u_out[11]} {u_out[12]} {u_out[13]} {u_out[14]} {u_out[15]} {u_out[16]} {u_out[17]} {u_out[18]} {u_out[19]} {u_out[20]} {u_out[21]} {u_out[22]} {u_out[23]} {u_out[24]} {u_out[25]} {u_out[26]} {u_out[27]} {u_out[28]} {u_out[29]} {u_out[30]} {u_out[31]} {u_out[32]} {u_out[33]} {u_out[34]} {u_out[35]} {u_out[36]} {u_out[37]} {u_out[38]} {u_out[39]} {u_out[40]} {u_out[41]} {u_out[42]} {u_out[43]} {u_out[44]} {u_out[45]} {u_out[46]} {u_out[47]} {u_out[48]} {u_out[49]} {u_out[50]} {u_out[51]} {u_out[52]} {u_out[53]} {u_out[54]} {u_out[55]} {u_out[56]} {u_out[57]} {u_out[58]} {u_out[59]} {u_out[60]} {u_out[61]} {u_out[62]} {u_out[63]} {u_out[64]} {u_out[65]} {u_out[66]} {u_out[67]} {u_out[68]} {u_out[69]} {u_out[70]} {u_out[71]} {u_out[72]} {u_out[73]} {u_out[74]} {u_out[75]} {u_out[76]} {u_out[77]} {u_out[78]} {u_out[79]} {u_out[80]} {u_out[81]} {u_out[82]} {u_out[83]} {u_out[84]} {u_out[85]} {u_out[86]} {u_out[87]} {u_out[88]} {u_out[89]} {u_out[90]} {u_out[91]} {u_out[92]} {u_out[93]} {u_out[94]} {u_out[95]} {u_out[96]} {u_out[97]} {u_out[98]} {u_out[99]} {u_out[100]} {u_out[101]} {u_out[102]} {u_out[103]} {u_out[104]} {u_out[105]} {u_out[106]} {u_out[107]} {u_out[108]} {u_out[109]} {u_out[110]} {u_out[111]} {u_out[112]} {u_out[113]} {u_out[114]} {u_out[115]} {u_out[116]} {u_out[117]} {u_out[118]} {u_out[119]} {u_out[120]} {u_out[121]} {u_out[122]} {u_out[123]} {u_out[124]} {u_out[125]} {u_out[126]} {u_out[127]}}
setPinAssignMode -pinEditInBatch true
editPin -pinWidth 0.14 -pinDepth 0.14 -fixOverlap 1 -unit MICRON -spreadDirection clockwise -side Right -layer 6 -spreadType center -spacing 0.28 -pin {{u_out[0]} {u_out[1]} {u_out[2]} {u_out[3]} {u_out[4]} {u_out[5]} {u_out[6]} {u_out[7]} {u_out[8]} {u_out[9]} {u_out[10]} {u_out[11]} {u_out[12]} {u_out[13]} {u_out[14]} {u_out[15]} {u_out[16]} {u_out[17]} {u_out[18]} {u_out[19]} {u_out[20]} {u_out[21]} {u_out[22]} {u_out[23]} {u_out[24]} {u_out[25]} {u_out[26]} {u_out[27]} {u_out[28]} {u_out[29]} {u_out[30]} {u_out[31]} {u_out[32]} {u_out[33]} {u_out[34]} {u_out[35]} {u_out[36]} {u_out[37]} {u_out[38]} {u_out[39]} {u_out[40]} {u_out[41]} {u_out[42]} {u_out[43]} {u_out[44]} {u_out[45]} {u_out[46]} {u_out[47]} {u_out[48]} {u_out[49]} {u_out[50]} {u_out[51]} {u_out[52]} {u_out[53]} {u_out[54]} {u_out[55]} {u_out[56]} {u_out[57]} {u_out[58]} {u_out[59]} {u_out[60]} {u_out[61]} {u_out[62]} {u_out[63]} {u_out[64]} {u_out[65]} {u_out[66]} {u_out[67]} {u_out[68]} {u_out[69]} {u_out[70]} {u_out[71]} {u_out[72]} {u_out[73]} {u_out[74]} {u_out[75]} {u_out[76]} {u_out[77]} {u_out[78]} {u_out[79]} {u_out[80]} {u_out[81]} {u_out[82]} {u_out[83]} {u_out[84]} {u_out[85]} {u_out[86]} {u_out[87]} {u_out[88]} {u_out[89]} {u_out[90]} {u_out[91]} {u_out[92]} {u_out[93]} {u_out[94]} {u_out[95]} {u_out[96]} {u_out[97]} {u_out[98]} {u_out[99]} {u_out[100]} {u_out[101]} {u_out[102]} {u_out[103]} {u_out[104]} {u_out[105]} {u_out[106]} {u_out[107]} {u_out[108]} {u_out[109]} {u_out[110]} {u_out[111]} {u_out[112]} {u_out[113]} {u_out[114]} {u_out[115]} {u_out[116]} {u_out[117]} {u_out[118]} {u_out[119]} {u_out[120]} {u_out[121]} {u_out[122]} {u_out[123]} {u_out[124]} {u_out[125]} {u_out[126]} {u_out[127]}}
setPinAssignMode -pinEditInBatch true
editPin -use POWER -fixOverlap 1 -unit MICRON -spreadDirection clockwise -side Top -layer 1 -spreadType center -spacing 0.14 -pin VDD
set ptngSprNoRefreshPins 1
setPtnPinStatus -cell key_generation -pin VSS -status unplaced -silent
set ptngSprNoRefreshPins 0
ptnSprRefreshPinsAndBlockages
setPinAssignMode -pinEditInBatch true
editPin -use GROUND -fixOverlap 1 -unit MICRON -spreadDirection clockwise -side Bottom -layer 1 -spreadType center -spacing 1.0 -pin VSS
setPinAssignMode -pinEditInBatch true
editPin -use GROUND -pinWidth 0.07 -pinDepth 0.07 -fixOverlap 1 -unit MICRON -spreadDirection clockwise -side Bottom -layer 10 -spreadType center -spacing 0.14 -pin VSS
setPinAssignMode -pinEditInBatch true
editPin -pinWidth 0.14 -pinDepth 0.14 -fixOverlap 1 -unit MICRON -spreadDirection clockwise -side Top -layer 6 -spreadType center -spacing 0.28 -pin {{q[0]} {q[1]} {q[2]} {q[3]} {q[4]} {q[5]} {q[6]} {q[7]} {q[8]} {q[9]} {q[10]} {q[11]} {q[12]} {q[13]} {q[14]} {q[15]} {q[16]} {q[17]} {q[18]} {q[19]} {q[20]} {q[21]} {q[22]} {q[23]} {q[24]} {q[25]} {q[26]} {q[27]} {q[28]} {q[29]} {q[30]} {q[31]} {q[32]} {q[33]} {q[34]} {q[35]} {q[36]} {q[37]} {q[38]} {q[39]} {q[40]} {q[41]} {q[42]} {q[43]} {q[44]} {q[45]} {q[46]} {q[47]} {q[48]} {q[49]} {q[50]} {q[51]} {q[52]} {q[53]} {q[54]} {q[55]} {q[56]} {q[57]} {q[58]} {q[59]} {q[60]} {q[61]} {q[62]} {q[63]}}
setPinAssignMode -pinEditInBatch true
editPin -pinWidth 0.14 -pinDepth 0.14 -fixOverlap 1 -unit MICRON -spreadDirection clockwise -side Bottom -layer 2 -spreadType center -spacing -0.28 -pin {{g_out[0]} {g_out[1]} {g_out[2]} {g_out[3]} {g_out[4]} {g_out[5]} {g_out[6]} {g_out[7]} {g_out[8]} {g_out[9]} {g_out[10]} {g_out[11]} {g_out[12]} {g_out[13]} {g_out[14]} {g_out[15]} {g_out[16]} {g_out[17]} {g_out[18]} {g_out[19]} {g_out[20]} {g_out[21]} {g_out[22]} {g_out[23]} {g_out[24]} {g_out[25]} {g_out[26]} {g_out[27]} {g_out[28]} {g_out[29]} {g_out[30]} {g_out[31]} {g_out[32]} {g_out[33]} {g_out[34]} {g_out[35]} {g_out[36]} {g_out[37]} {g_out[38]} {g_out[39]} {g_out[40]} {g_out[41]} {g_out[42]} {g_out[43]} {g_out[44]} {g_out[45]} {g_out[46]} {g_out[47]} {g_out[48]} {g_out[49]} {g_out[50]} {g_out[51]} {g_out[52]} {g_out[53]} {g_out[54]} {g_out[55]} {g_out[56]} {g_out[57]} {g_out[58]} {g_out[59]} {g_out[60]} {g_out[61]} {g_out[62]} {g_out[63]} {g_out[64]} {g_out[65]} {g_out[66]} {g_out[67]} {g_out[68]} {g_out[69]} {g_out[70]} {g_out[71]} {g_out[72]} {g_out[73]} {g_out[74]} {g_out[75]} {g_out[76]} {g_out[77]} {g_out[78]} {g_out[79]} {g_out[80]} {g_out[81]} {g_out[82]} {g_out[83]} {g_out[84]} {g_out[85]} {g_out[86]} {g_out[87]} {g_out[88]} {g_out[89]} {g_out[90]} {g_out[91]} {g_out[92]} {g_out[93]} {g_out[94]} {g_out[95]} {g_out[96]} {g_out[97]} {g_out[98]} {g_out[99]} {g_out[100]} {g_out[101]} {g_out[102]} {g_out[103]} {g_out[104]} {g_out[105]} {g_out[106]} {g_out[107]} {g_out[108]} {g_out[109]} {g_out[110]} {g_out[111]} {g_out[112]} {g_out[113]} {g_out[114]} {g_out[115]} {g_out[116]} {g_out[117]} {g_out[118]} {g_out[119]} {g_out[120]} {g_out[121]} {g_out[122]} {g_out[123]} {g_out[124]} {g_out[125]} {g_out[126]} {g_out[127]}}
setPinAssignMode -pinEditInBatch true
editPin -pinWidth 0.14 -pinDepth 0.14 -fixOverlap 1 -unit MICRON -spreadDirection clockwise -side Bottom -layer 4 -spreadType center -spacing 0.28 -pin {{g_out[0]} {g_out[1]} {g_out[2]} {g_out[3]} {g_out[4]} {g_out[5]} {g_out[6]} {g_out[7]} {g_out[8]} {g_out[9]} {g_out[10]} {g_out[11]} {g_out[12]} {g_out[13]} {g_out[14]} {g_out[15]} {g_out[16]} {g_out[17]} {g_out[18]} {g_out[19]} {g_out[20]} {g_out[21]} {g_out[22]} {g_out[23]} {g_out[24]} {g_out[25]} {g_out[26]} {g_out[27]} {g_out[28]} {g_out[29]} {g_out[30]} {g_out[31]} {g_out[32]} {g_out[33]} {g_out[34]} {g_out[35]} {g_out[36]} {g_out[37]} {g_out[38]} {g_out[39]} {g_out[40]} {g_out[41]} {g_out[42]} {g_out[43]} {g_out[44]} {g_out[45]} {g_out[46]} {g_out[47]} {g_out[48]} {g_out[49]} {g_out[50]} {g_out[51]} {g_out[52]} {g_out[53]} {g_out[54]} {g_out[55]} {g_out[56]} {g_out[57]} {g_out[58]} {g_out[59]} {g_out[60]} {g_out[61]} {g_out[62]} {g_out[63]} {g_out[64]} {g_out[65]} {g_out[66]} {g_out[67]} {g_out[68]} {g_out[69]} {g_out[70]} {g_out[71]} {g_out[72]} {g_out[73]} {g_out[74]} {g_out[75]} {g_out[76]} {g_out[77]} {g_out[78]} {g_out[79]} {g_out[80]} {g_out[81]} {g_out[82]} {g_out[83]} {g_out[84]} {g_out[85]} {g_out[86]} {g_out[87]} {g_out[88]} {g_out[89]} {g_out[90]} {g_out[91]} {g_out[92]} {g_out[93]} {g_out[94]} {g_out[95]} {g_out[96]} {g_out[97]} {g_out[98]} {g_out[99]} {g_out[100]} {g_out[101]} {g_out[102]} {g_out[103]} {g_out[104]} {g_out[105]} {g_out[106]} {g_out[107]} {g_out[108]} {g_out[109]} {g_out[110]} {g_out[111]} {g_out[112]} {g_out[113]} {g_out[114]} {g_out[115]} {g_out[116]} {g_out[117]} {g_out[118]} {g_out[119]} {g_out[120]} {g_out[121]} {g_out[122]} {g_out[123]} {g_out[124]} {g_out[125]} {g_out[126]} {g_out[127]}}
setPinAssignMode -pinEditInBatch true
editPin -pinWidth 0.14 -pinDepth 0.14 -fixOverlap 1 -unit MICRON -spreadDirection clockwise -side Top -layer 2 -spreadType center -spacing 0.28 -pin {{n_out[0]} {n_out[1]} {n_out[2]} {n_out[3]} {n_out[4]} {n_out[5]} {n_out[6]} {n_out[7]} {n_out[8]} {n_out[9]} {n_out[10]} {n_out[11]} {n_out[12]} {n_out[13]} {n_out[14]} {n_out[15]} {n_out[16]} {n_out[17]} {n_out[18]} {n_out[19]} {n_out[20]} {n_out[21]} {n_out[22]} {n_out[23]} {n_out[24]} {n_out[25]} {n_out[26]} {n_out[27]} {n_out[28]} {n_out[29]} {n_out[30]} {n_out[31]} {n_out[32]} {n_out[33]} {n_out[34]} {n_out[35]} {n_out[36]} {n_out[37]} {n_out[38]} {n_out[39]} {n_out[40]} {n_out[41]} {n_out[42]} {n_out[43]} {n_out[44]} {n_out[45]} {n_out[46]} {n_out[47]} {n_out[48]} {n_out[49]} {n_out[50]} {n_out[51]} {n_out[52]} {n_out[53]} {n_out[54]} {n_out[55]} {n_out[56]} {n_out[57]} {n_out[58]} {n_out[59]} {n_out[60]} {n_out[61]} {n_out[62]} {n_out[63]} {n_out[64]} {n_out[65]} {n_out[66]} {n_out[67]} {n_out[68]} {n_out[69]} {n_out[70]} {n_out[71]} {n_out[72]} {n_out[73]} {n_out[74]} {n_out[75]} {n_out[76]} {n_out[77]} {n_out[78]} {n_out[79]} {n_out[80]} {n_out[81]} {n_out[82]} {n_out[83]} {n_out[84]} {n_out[85]} {n_out[86]} {n_out[87]} {n_out[88]} {n_out[89]} {n_out[90]} {n_out[91]} {n_out[92]} {n_out[93]} {n_out[94]} {n_out[95]} {n_out[96]} {n_out[97]} {n_out[98]} {n_out[99]} {n_out[100]} {n_out[101]} {n_out[102]} {n_out[103]} {n_out[104]} {n_out[105]} {n_out[106]} {n_out[107]} {n_out[108]} {n_out[109]} {n_out[110]} {n_out[111]} {n_out[112]} {n_out[113]} {n_out[114]} {n_out[115]} {n_out[116]} {n_out[117]} {n_out[118]} {n_out[119]} {n_out[120]} {n_out[121]} {n_out[122]} {n_out[123]} {n_out[124]} {n_out[125]} {n_out[126]} {n_out[127]}}
pan 329.878 -78.543
setPinAssignMode -pinEditInBatch true
editPin -pinWidth 0.14 -pinDepth 0.14 -fixOverlap 1 -unit MICRON -spreadDirection clockwise -side Top -layer 5 -spreadType center -spacing 0.28 -pin start
setPinAssignMode -pinEditInBatch false
pan 41.085 150.988
pan -349.225 -99.632
saveDesign Top.enc
addRing -nets {VSS VDD} -type core_rings -follow io -layer {top metal5 bottom metal5 left metal4 right metal4} -width {top 1 bottom 1 left 1 right 1} -spacing {top 1 bottom 1 left 1 right 1} -offset {top 0 bottom 0 left 0 right 0} -center 0 -extend_corner {} -threshold 0 -jog_distance 0 -snap_wire_center_to_grid None
addStripe -block_ring_top_layer_limit metal5 -max_same_layer_jog_length 1.6 -padcore_ring_bottom_layer_limit metal3 -set_to_set_distance 5 -stacked_via_top_layer metal10 -padcore_ring_top_layer_limit metal5 -spacing 1 -xleft_offset 1 -merge_stripes_value 0.095 -layer metal4 -block_ring_bottom_layer_limit metal3 -width 1 -nets {VSS VDD} -stacked_via_bottom_layer metal1
sroute -connect { blockPin padPin padRing corePin floatingStripe } -layerChangeRange { 1 10 } -blockPinTarget {nearestRingStripe nearestTarget } -padPinPortConnect { allPort oneGeom } -checkAlignedSecondaryPin 1 -blockPin useLef -allowJogging 1 -crossoverViaBottomLayer 1 -allowLayerChange 1 -targetViaTopLayer 10 -crossoverViaTopLayer 10 -targetViaBottomLayer 1 -nets { VDD VSS }
saveDesign Top_power.enc
editPowerVia -skip_via_on_pin Standardcell -bottom_layer metal1 -add_vias 1 -top_layer metal8
setEndCapMode -reset
setEndCapMode -boundary_tap false
setPlaceMode -reset
setPlaceMode -congEffort auto -timingDriven 1 -modulePlan 1 -clkGateAware 1 -powerDriven 0 -ignoreScan 1 -reorderScan 1 -ignoreSpare 0 -placeIOPins 0 -moduleAwareSpare 0 -preserveRouting 0 -rmAffectedRouting 0 -checkRoute 0 -swapEEQ 0
setPlaceMode -fp false
placeDesign
timeDesign -preCTS -numPaths 200
optDesign -preCTS -numPaths 200
setDrawView place
saveDesign Top_place.enc
setDesignMode -process 45
fit
setDrawView fplan
getIoFlowFlag
floorPlan -r 1.0 0.6 2 2 2 2
uiSetTool select
getIoFlowFlag
pan -0.776 10.092
pan 255.420 30.838
globalNetConnect VDD -type pgpin -pin VDD -inst *
globalNetConnect VSS -type pgpin -pin VSS -inst *
globalNetConnect VDD -type tiehi
globalNetConnect VSS -type tielo
saveDesign Top.enc
addRing -nets {VSS VDD} -type core_rings -follow io -layer {top metal5 bottom metal5 left metal4 right metal4} -width {top 1 bottom 1 left 1 right 1} -spacing {top 1 bottom 1 left 1 right 1} -offset {top 0 bottom 0 left 0 right 0} -center 0 -extend_corner {} -threshold 0 -jog_distance 0 -snap_wire_center_to_grid None
addStripe -block_ring_top_layer_limit metal5 -max_same_layer_jog_length 1.6 -padcore_ring_bottom_layer_limit metal3 -set_to_set_distance 5 -stacked_via_top_layer metal10 -padcore_ring_top_layer_limit metal5 -spacing 1 -xleft_offset 1 -merge_stripes_value 0.095 -layer metal4 -block_ring_bottom_layer_limit metal3 -width 1 -nets {VSS VDD} -stacked_via_bottom_layer metal1
sroute -connect { blockPin padPin padRing corePin floatingStripe } -layerChangeRange { 1 10 } -blockPinTarget {nearestRingStripe nearestTarget } -padPinPortConnect { allPort oneGeom } -checkAlignedSecondaryPin 1 -blockPin useLef -allowJogging 1 -crossoverViaBottomLayer 1 -allowLayerChange 1 -targetViaTopLayer 10 -crossoverViaTopLayer 10 -targetViaBottomLayer 1 -nets { VDD VSS }
saveDesign Top_power.enc
pan -207.161 -107.939
pan -181.216 -4.559
pan -19.948 125.641
pan 7.445 0.972
pan 9.962 0.795
pan 50.931 1.621
pan 55.986 0.573
pan 59.413 0.584
pan 70.802 -1.459
editPowerVia -skip_via_on_pin Standardcell -bottom_layer metal1 -add_vias 1 -top_layer metal8
setEndCapMode -reset
setEndCapMode -boundary_tap false
setPlaceMode -reset
setPlaceMode -congEffort auto -timingDriven 1 -modulePlan 1 -clkGateAware 1 -powerDriven 0 -ignoreScan 1 -reorderScan 1 -ignoreSpare 0 -placeIOPins 0 -moduleAwareSpare 0 -preserveRouting 0 -rmAffectedRouting 0 -checkRoute 0 -swapEEQ 0
setPlaceMode -fp false
placeDesign
timeDesign -preCTS -numPaths 200
optDesign -preCTS -numPaths 200
setDrawView place
pan 52.745 1.621
pan 53.700 -0.667
pan 41.681 -0.096
pan 55.798 -2.385
pan 43.876 2.766
pan -0.041 -1.286
pan 0.376 -2.768
pan 0.498 1.967
getPinAssignMode -pinEditInBatch -quiet
setPinAssignMode -pinEditInBatch true
editPin -pinWidth 0.07 -pinDepth 0.07 -fixOverlap 1 -unit MICRON -spreadDirection clockwise -side Top -layer 3 -spreadType center -spacing 0.14 -pin {{addr_rd_out[0]} {addr_rd_out[1]} {addr_rd_out[2]} {addr_rd_out[3]} {addr_rd_out[4]} {addr_rd_out[5]} {addr_rd_out[6]} {addr_rd_out[7]} {addr_rd_out[8]} {addr_rd_out[9]} {addr_rd_out[10]} {addr_rd_out[11]} {addr_rd_out[12]} {addr_rd_out[13]} {addr_rd_out[14]} {addr_rd_out[15]} {addr_rd_out[16]} {addr_rd_out[17]} {addr_rd_out[18]} {addr_rd_out[19]} {addr_rd_out[20]} {addr_rd_out[21]} {addr_rd_out[22]} {addr_rd_out[23]} {addr_rd_out[24]} {addr_rd_out[25]} {addr_rd_out[26]} {addr_rd_out[27]} {addr_rd_out[28]} {addr_rd_out[29]} {addr_rd_out[30]} {addr_rd_out[31]} {addr_rd_out[32]} {addr_rd_out[33]} {addr_rd_out[34]} {addr_rd_out[35]} {addr_rd_out[36]} {addr_rd_out[37]} {addr_rd_out[38]} {addr_rd_out[39]} {addr_rd_out[40]} {addr_rd_out[41]} {addr_rd_out[42]} {addr_rd_out[43]} {addr_rd_out[44]} {addr_rd_out[45]} {addr_rd_out[46]} {addr_rd_out[47]} {addr_rd_out[48]} {addr_rd_out[49]} {addr_rd_out[50]} {addr_rd_out[51]} {addr_rd_out[52]} {addr_rd_out[53]} {addr_rd_out[54]} {addr_rd_out[55]} {addr_rd_out[56]} {addr_rd_out[57]} {addr_rd_out[58]} {addr_rd_out[59]} {addr_rd_out[60]} {addr_rd_out[61]} {addr_rd_out[62]} {addr_rd_out[63]}}
setPinAssignMode -pinEditInBatch true
editPin -pinWidth 0.07 -pinDepth 0.07 -fixOverlap 1 -unit MICRON -spreadDirection clockwise -side Left -layer 3 -spreadType center -spacing 0.14 -pin {{addr_wr_out[0]} {addr_wr_out[1]} {addr_wr_out[2]} {addr_wr_out[3]} {addr_wr_out[4]} {addr_wr_out[5]} {addr_wr_out[6]} {addr_wr_out[7]} {addr_wr_out[8]} {addr_wr_out[9]} {addr_wr_out[10]} {addr_wr_out[11]} {addr_wr_out[12]} {addr_wr_out[13]} {addr_wr_out[14]} {addr_wr_out[15]} {addr_wr_out[16]} {addr_wr_out[17]} {addr_wr_out[18]} {addr_wr_out[19]} {addr_wr_out[20]} {addr_wr_out[21]} {addr_wr_out[22]} {addr_wr_out[23]} {addr_wr_out[24]} {addr_wr_out[25]} {addr_wr_out[26]} {addr_wr_out[27]} {addr_wr_out[28]} {addr_wr_out[29]} {addr_wr_out[30]} {addr_wr_out[31]} {addr_wr_out[32]} {addr_wr_out[33]} {addr_wr_out[34]} {addr_wr_out[35]} {addr_wr_out[36]} {addr_wr_out[37]} {addr_wr_out[38]} {addr_wr_out[39]} {addr_wr_out[40]} {addr_wr_out[41]} {addr_wr_out[42]} {addr_wr_out[43]} {addr_wr_out[44]} {addr_wr_out[45]} {addr_wr_out[46]} {addr_wr_out[47]} {addr_wr_out[48]} {addr_wr_out[49]} {addr_wr_out[50]} {addr_wr_out[51]} {addr_wr_out[52]} {addr_wr_out[53]} {addr_wr_out[54]} {addr_wr_out[55]} {addr_wr_out[56]} {addr_wr_out[57]} {addr_wr_out[58]} {addr_wr_out[59]} {addr_wr_out[60]} {addr_wr_out[61]} {addr_wr_out[62]} {addr_wr_out[63]}}
getPinAssignMode -pinEditInBatch -quiet
setPinAssignMode -pinEditInBatch true
editPin -pinWidth 0.14 -pinDepth 0.14 -fixOverlap 1 -unit MICRON -spreadDirection clockwise -side Top -layer 4 -spreadType center -spacing 0.28 -pin {{g_out[0]} {g_out[1]} {g_out[2]} {g_out[3]} {g_out[4]} {g_out[5]} {g_out[6]} {g_out[7]} {g_out[8]} {g_out[9]} {g_out[10]} {g_out[11]} {g_out[12]} {g_out[13]} {g_out[14]} {g_out[15]} {g_out[16]} {g_out[17]} {g_out[18]} {g_out[19]} {g_out[20]} {g_out[21]} {g_out[22]} {g_out[23]} {g_out[24]} {g_out[25]} {g_out[26]} {g_out[27]} {g_out[28]} {g_out[29]} {g_out[30]} {g_out[31]} {g_out[32]} {g_out[33]} {g_out[34]} {g_out[35]} {g_out[36]} {g_out[37]} {g_out[38]} {g_out[39]} {g_out[40]} {g_out[41]} {g_out[42]} {g_out[43]} {g_out[44]} {g_out[45]} {g_out[46]} {g_out[47]} {g_out[48]} {g_out[49]} {g_out[50]} {g_out[51]} {g_out[52]} {g_out[53]} {g_out[54]} {g_out[55]} {g_out[56]} {g_out[57]} {g_out[58]} {g_out[59]} {g_out[60]} {g_out[61]} {g_out[62]} {g_out[63]} {g_out[64]} {g_out[65]} {g_out[66]} {g_out[67]} {g_out[68]} {g_out[69]} {g_out[70]} {g_out[71]} {g_out[72]} {g_out[73]} {g_out[74]} {g_out[75]} {g_out[76]} {g_out[77]} {g_out[78]} {g_out[79]} {g_out[80]} {g_out[81]} {g_out[82]} {g_out[83]} {g_out[84]} {g_out[85]} {g_out[86]} {g_out[87]} {g_out[88]} {g_out[89]} {g_out[90]} {g_out[91]} {g_out[92]} {g_out[93]} {g_out[94]} {g_out[95]} {g_out[96]} {g_out[97]} {g_out[98]} {g_out[99]} {g_out[100]} {g_out[101]} {g_out[102]} {g_out[103]} {g_out[104]} {g_out[105]} {g_out[106]} {g_out[107]} {g_out[108]} {g_out[109]} {g_out[110]} {g_out[111]} {g_out[112]} {g_out[113]} {g_out[114]} {g_out[115]} {g_out[116]} {g_out[117]} {g_out[118]} {g_out[119]} {g_out[120]} {g_out[121]} {g_out[122]} {g_out[123]} {g_out[124]} {g_out[125]} {g_out[126]} {g_out[127]}}
setPinAssignMode -pinEditInBatch true
editPin -pinWidth 0.14 -pinDepth 0.14 -fixOverlap 1 -unit MICRON -spreadDirection clockwise -side Bottom -layer 4 -spreadType center -spacing 0.28 -pin {{lambda_out[0]} {lambda_out[1]} {lambda_out[2]} {lambda_out[3]} {lambda_out[4]} {lambda_out[5]} {lambda_out[6]} {lambda_out[7]} {lambda_out[8]} {lambda_out[9]} {lambda_out[10]} {lambda_out[11]} {lambda_out[12]} {lambda_out[13]} {lambda_out[14]} {lambda_out[15]} {lambda_out[16]} {lambda_out[17]} {lambda_out[18]} {lambda_out[19]} {lambda_out[20]} {lambda_out[21]} {lambda_out[22]} {lambda_out[23]} {lambda_out[24]} {lambda_out[25]} {lambda_out[26]} {lambda_out[27]} {lambda_out[28]} {lambda_out[29]} {lambda_out[30]} {lambda_out[31]} {lambda_out[32]} {lambda_out[33]} {lambda_out[34]} {lambda_out[35]} {lambda_out[36]} {lambda_out[37]} {lambda_out[38]} {lambda_out[39]} {lambda_out[40]} {lambda_out[41]} {lambda_out[42]} {lambda_out[43]} {lambda_out[44]} {lambda_out[45]} {lambda_out[46]} {lambda_out[47]} {lambda_out[48]} {lambda_out[49]} {lambda_out[50]} {lambda_out[51]} {lambda_out[52]} {lambda_out[53]} {lambda_out[54]} {lambda_out[55]} {lambda_out[56]} {lambda_out[57]} {lambda_out[58]} {lambda_out[59]} {lambda_out[60]} {lambda_out[61]} {lambda_out[62]} {lambda_out[63]} {lambda_out[64]} {lambda_out[65]} {lambda_out[66]} {lambda_out[67]} {lambda_out[68]} {lambda_out[69]} {lambda_out[70]} {lambda_out[71]} {lambda_out[72]} {lambda_out[73]} {lambda_out[74]} {lambda_out[75]} {lambda_out[76]} {lambda_out[77]} {lambda_out[78]} {lambda_out[79]} {lambda_out[80]} {lambda_out[81]} {lambda_out[82]} {lambda_out[83]} {lambda_out[84]} {lambda_out[85]} {lambda_out[86]} {lambda_out[87]} {lambda_out[88]} {lambda_out[89]} {lambda_out[90]} {lambda_out[91]} {lambda_out[92]} {lambda_out[93]} {lambda_out[94]} {lambda_out[95]} {lambda_out[96]} {lambda_out[97]} {lambda_out[98]} {lambda_out[99]} {lambda_out[100]} {lambda_out[101]} {lambda_out[102]} {lambda_out[103]} {lambda_out[104]} {lambda_out[105]} {lambda_out[106]} {lambda_out[107]} {lambda_out[108]} {lambda_out[109]} {lambda_out[110]} {lambda_out[111]} {lambda_out[112]} {lambda_out[113]} {lambda_out[114]} {lambda_out[115]} {lambda_out[116]} {lambda_out[117]} {lambda_out[118]} {lambda_out[119]} {lambda_out[120]} {lambda_out[121]} {lambda_out[122]} {lambda_out[123]} {lambda_out[124]} {lambda_out[125]} {lambda_out[126]} {lambda_out[127]}}
setPinAssignMode -pinEditInBatch true
editPin -pinWidth 0.07 -pinDepth 0.07 -fixOverlap 1 -unit MICRON -spreadDirection clockwise -side Left -layer 3 -spreadType center -spacing 0.14 -pin mem_wr_en
setPinAssignMode -pinEditInBatch true
editPin -pinWidth 0.14 -pinDepth 0.14 -fixOverlap 1 -unit MICRON -spreadDirection clockwise -side Top -layer 2 -spreadType center -spacing 0.19 -pin {{n_out[0]} {n_out[1]} {n_out[2]} {n_out[3]} {n_out[4]} {n_out[5]} {n_out[6]} {n_out[7]} {n_out[8]} {n_out[9]} {n_out[10]} {n_out[11]} {n_out[12]} {n_out[13]} {n_out[14]} {n_out[15]} {n_out[16]} {n_out[17]} {n_out[18]} {n_out[19]} {n_out[20]} {n_out[21]} {n_out[22]} {n_out[23]} {n_out[24]} {n_out[25]} {n_out[26]} {n_out[27]} {n_out[28]} {n_out[29]} {n_out[30]} {n_out[31]} {n_out[32]} {n_out[33]} {n_out[34]} {n_out[35]} {n_out[36]} {n_out[37]} {n_out[38]} {n_out[39]} {n_out[40]} {n_out[41]} {n_out[42]} {n_out[43]} {n_out[44]} {n_out[45]} {n_out[46]} {n_out[47]} {n_out[48]} {n_out[49]} {n_out[50]} {n_out[51]} {n_out[52]} {n_out[53]} {n_out[54]} {n_out[55]} {n_out[56]} {n_out[57]} {n_out[58]} {n_out[59]} {n_out[60]} {n_out[61]} {n_out[62]} {n_out[63]} {n_out[64]} {n_out[65]} {n_out[66]} {n_out[67]} {n_out[68]} {n_out[69]} {n_out[70]} {n_out[71]} {n_out[72]} {n_out[73]} {n_out[74]} {n_out[75]} {n_out[76]} {n_out[77]} {n_out[78]} {n_out[79]} {n_out[80]} {n_out[81]} {n_out[82]} {n_out[83]} {n_out[84]} {n_out[85]} {n_out[86]} {n_out[87]} {n_out[88]} {n_out[89]} {n_out[90]} {n_out[91]} {n_out[92]} {n_out[93]} {n_out[94]} {n_out[95]} {n_out[96]} {n_out[97]} {n_out[98]} {n_out[99]} {n_out[100]} {n_out[101]} {n_out[102]} {n_out[103]} {n_out[104]} {n_out[105]} {n_out[106]} {n_out[107]} {n_out[108]} {n_out[109]} {n_out[110]} {n_out[111]} {n_out[112]} {n_out[113]} {n_out[114]} {n_out[115]} {n_out[116]} {n_out[117]} {n_out[118]} {n_out[119]} {n_out[120]} {n_out[121]} {n_out[122]} {n_out[123]} {n_out[124]} {n_out[125]} {n_out[126]} {n_out[127]}}
setPinAssignMode -pinEditInBatch true
editPin -pinWidth 0.14 -pinDepth 0.14 -fixOverlap 1 -unit MICRON -spreadDirection clockwise -side Top -layer 4 -spreadType center -spacing 0.38 -pin {{p[0]} {p[1]} {p[2]} {p[3]} {p[4]} {p[5]} {p[6]} {p[7]} {p[8]} {p[9]} {p[10]} {p[11]} {p[12]} {p[13]} {p[14]} {p[15]} {p[16]} {p[17]} {p[18]} {p[19]} {p[20]} {p[21]} {p[22]} {p[23]} {p[24]} {p[25]} {p[26]} {p[27]} {p[28]} {p[29]} {p[30]} {p[31]} {p[32]} {p[33]} {p[34]} {p[35]} {p[36]} {p[37]} {p[38]} {p[39]} {p[40]} {p[41]} {p[42]} {p[43]} {p[44]} {p[45]} {p[46]} {p[47]} {p[48]} {p[49]} {p[50]} {p[51]} {p[52]} {p[53]} {p[54]} {p[55]} {p[56]} {p[57]} {p[58]} {p[59]} {p[60]} {p[61]} {p[62]} {p[63]}}
setPinAssignMode -pinEditInBatch true
editPin -pinWidth 0.14 -pinDepth 0.14 -fixOverlap 1 -unit MICRON -spreadDirection clockwise -side Top -layer 6 -spreadType center -spacing 0.38 -pin {{q[0]} {q[1]} {q[2]} {q[3]} {q[4]} {q[5]} {q[6]} {q[7]} {q[8]} {q[9]} {q[10]} {q[11]} {q[12]} {q[13]} {q[14]} {q[15]} {q[16]} {q[17]} {q[18]} {q[19]} {q[20]} {q[21]} {q[22]} {q[23]} {q[24]} {q[25]} {q[26]} {q[27]} {q[28]} {q[29]} {q[30]} {q[31]} {q[32]} {q[33]} {q[34]} {q[35]} {q[36]} {q[37]} {q[38]} {q[39]} {q[40]} {q[41]} {q[42]} {q[43]} {q[44]} {q[45]} {q[46]} {q[47]} {q[48]} {q[49]} {q[50]} {q[51]} {q[52]} {q[53]} {q[54]} {q[55]} {q[56]} {q[57]} {q[58]} {q[59]} {q[60]} {q[61]} {q[62]} {q[63]}}
setPinAssignMode -pinEditInBatch true
editPin -pinWidth 0.14 -pinDepth 0.14 -fixOverlap 1 -unit MICRON -spreadDirection clockwise -side Top -layer 5 -spreadType center -spacing 0.28 -pin rst
setPinAssignMode -pinEditInBatch true
editPin -pinWidth 0.14 -pinDepth 0.14 -fixOverlap 1 -unit MICRON -spreadDirection clockwise -side Top -layer 5 -spreadType center -spacing 0.28 -pin start
setPinAssignMode -pinEditInBatch true
editPin -pinWidth 0.14 -pinDepth 0.14 -fixOverlap 1 -unit MICRON -spreadDirection clockwise -side Right -layer 6 -spreadType center -spacing 0.28 -pin {{u_out[0]} {u_out[1]} {u_out[2]} {u_out[3]} {u_out[4]} {u_out[5]} {u_out[6]} {u_out[7]} {u_out[8]} {u_out[9]} {u_out[10]} {u_out[11]} {u_out[12]} {u_out[13]} {u_out[14]} {u_out[15]} {u_out[16]} {u_out[17]} {u_out[18]} {u_out[19]} {u_out[20]} {u_out[21]} {u_out[22]} {u_out[23]} {u_out[24]} {u_out[25]} {u_out[26]} {u_out[27]} {u_out[28]} {u_out[29]} {u_out[30]} {u_out[31]} {u_out[32]} {u_out[33]} {u_out[34]} {u_out[35]} {u_out[36]} {u_out[37]} {u_out[38]} {u_out[39]} {u_out[40]} {u_out[41]} {u_out[42]} {u_out[43]} {u_out[44]} {u_out[45]} {u_out[46]} {u_out[47]} {u_out[48]} {u_out[49]} {u_out[50]} {u_out[51]} {u_out[52]} {u_out[53]} {u_out[54]} {u_out[55]} {u_out[56]} {u_out[57]} {u_out[58]} {u_out[59]} {u_out[60]} {u_out[61]} {u_out[62]} {u_out[63]} {u_out[64]} {u_out[65]} {u_out[66]} {u_out[67]} {u_out[68]} {u_out[69]} {u_out[70]} {u_out[71]} {u_out[72]} {u_out[73]} {u_out[74]} {u_out[75]} {u_out[76]} {u_out[77]} {u_out[78]} {u_out[79]} {u_out[80]} {u_out[81]} {u_out[82]} {u_out[83]} {u_out[84]} {u_out[85]} {u_out[86]} {u_out[87]} {u_out[88]} {u_out[89]} {u_out[90]} {u_out[91]} {u_out[92]} {u_out[93]} {u_out[94]} {u_out[95]} {u_out[96]} {u_out[97]} {u_out[98]} {u_out[99]} {u_out[100]} {u_out[101]} {u_out[102]} {u_out[103]} {u_out[104]} {u_out[105]} {u_out[106]} {u_out[107]} {u_out[108]} {u_out[109]} {u_out[110]} {u_out[111]} {u_out[112]} {u_out[113]} {u_out[114]} {u_out[115]} {u_out[116]} {u_out[117]} {u_out[118]} {u_out[119]} {u_out[120]} {u_out[121]} {u_out[122]} {u_out[123]} {u_out[124]} {u_out[125]} {u_out[126]} {u_out[127]}}
setPinAssignMode -pinEditInBatch true
editPin -use POWER -pinWidth 0.07 -pinDepth 0.07 -fixOverlap 1 -unit MICRON -spreadDirection clockwise -side Top -layer 1 -spreadType center -spacing 0.14 -pin VDD
setPinAssignMode -pinEditInBatch true
editPin -use GROUND -pinWidth 0.8 -pinDepth 0.8 -fixOverlap 1 -unit MICRON -spreadDirection clockwise -side Bottom -layer 10 -spreadType center -spacing 1.6 -pin VSS
pan -161.346 -7.153
getPinAssignMode -pinEditInBatch -quiet
setPinAssignMode -pinEditInBatch true
editPin -pinWidth 0.07 -pinDepth 0.07 -fixOverlap 1 -spreadDirection clockwise -side Top -layer 3 -spreadType side -pin {{addr_rd_out[0]} {addr_rd_out[1]} {addr_rd_out[2]} {addr_rd_out[3]} {addr_rd_out[4]} {addr_rd_out[5]} {addr_rd_out[6]} {addr_rd_out[7]} {addr_rd_out[8]} {addr_rd_out[9]} {addr_rd_out[10]} {addr_rd_out[11]} {addr_rd_out[12]} {addr_rd_out[13]} {addr_rd_out[14]} {addr_rd_out[15]} {addr_rd_out[16]} {addr_rd_out[17]} {addr_rd_out[18]} {addr_rd_out[19]} {addr_rd_out[20]} {addr_rd_out[21]} {addr_rd_out[22]} {addr_rd_out[23]} {addr_rd_out[24]} {addr_rd_out[25]} {addr_rd_out[26]} {addr_rd_out[27]} {addr_rd_out[28]} {addr_rd_out[29]} {addr_rd_out[30]} {addr_rd_out[31]} {addr_rd_out[32]} {addr_rd_out[33]} {addr_rd_out[34]} {addr_rd_out[35]} {addr_rd_out[36]} {addr_rd_out[37]} {addr_rd_out[38]} {addr_rd_out[39]} {addr_rd_out[40]} {addr_rd_out[41]} {addr_rd_out[42]} {addr_rd_out[43]} {addr_rd_out[44]} {addr_rd_out[45]} {addr_rd_out[46]} {addr_rd_out[47]} {addr_rd_out[48]} {addr_rd_out[49]} {addr_rd_out[50]} {addr_rd_out[51]} {addr_rd_out[52]} {addr_rd_out[53]} {addr_rd_out[54]} {addr_rd_out[55]} {addr_rd_out[56]} {addr_rd_out[57]} {addr_rd_out[58]} {addr_rd_out[59]} {addr_rd_out[60]} {addr_rd_out[61]} {addr_rd_out[62]} {addr_rd_out[63]}}
setPinAssignMode -pinEditInBatch true
editPin -pinWidth 0.07 -pinDepth 0.07 -fixOverlap 1 -spreadDirection clockwise -side Left -layer 3 -spreadType side -pin {{addr_wr_out[0]} {addr_wr_out[1]} {addr_wr_out[2]} {addr_wr_out[3]} {addr_wr_out[4]} {addr_wr_out[5]} {addr_wr_out[6]} {addr_wr_out[7]} {addr_wr_out[8]} {addr_wr_out[9]} {addr_wr_out[10]} {addr_wr_out[11]} {addr_wr_out[12]} {addr_wr_out[13]} {addr_wr_out[14]} {addr_wr_out[15]} {addr_wr_out[16]} {addr_wr_out[17]} {addr_wr_out[18]} {addr_wr_out[19]} {addr_wr_out[20]} {addr_wr_out[21]} {addr_wr_out[22]} {addr_wr_out[23]} {addr_wr_out[24]} {addr_wr_out[25]} {addr_wr_out[26]} {addr_wr_out[27]} {addr_wr_out[28]} {addr_wr_out[29]} {addr_wr_out[30]} {addr_wr_out[31]} {addr_wr_out[32]} {addr_wr_out[33]} {addr_wr_out[34]} {addr_wr_out[35]} {addr_wr_out[36]} {addr_wr_out[37]} {addr_wr_out[38]} {addr_wr_out[39]} {addr_wr_out[40]} {addr_wr_out[41]} {addr_wr_out[42]} {addr_wr_out[43]} {addr_wr_out[44]} {addr_wr_out[45]} {addr_wr_out[46]} {addr_wr_out[47]} {addr_wr_out[48]} {addr_wr_out[49]} {addr_wr_out[50]} {addr_wr_out[51]} {addr_wr_out[52]} {addr_wr_out[53]} {addr_wr_out[54]} {addr_wr_out[55]} {addr_wr_out[56]} {addr_wr_out[57]} {addr_wr_out[58]} {addr_wr_out[59]} {addr_wr_out[60]} {addr_wr_out[61]} {addr_wr_out[62]} {addr_wr_out[63]}}
setPinAssignMode -pinEditInBatch true
editPin -pinWidth 0.07 -pinDepth 0.07 -fixOverlap 1 -spreadDirection clockwise -side Left -layer 3 -spreadType side -pin {{addr_wr_out[0]} {addr_wr_out[1]} {addr_wr_out[2]} {addr_wr_out[3]} {addr_wr_out[4]} {addr_wr_out[5]} {addr_wr_out[6]} {addr_wr_out[7]} {addr_wr_out[8]} {addr_wr_out[9]} {addr_wr_out[10]} {addr_wr_out[11]} {addr_wr_out[12]} {addr_wr_out[13]} {addr_wr_out[14]} {addr_wr_out[15]} {addr_wr_out[16]} {addr_wr_out[17]} {addr_wr_out[18]} {addr_wr_out[19]} {addr_wr_out[20]} {addr_wr_out[21]} {addr_wr_out[22]} {addr_wr_out[23]} {addr_wr_out[24]} {addr_wr_out[25]} {addr_wr_out[26]} {addr_wr_out[27]} {addr_wr_out[28]} {addr_wr_out[29]} {addr_wr_out[30]} {addr_wr_out[31]} {addr_wr_out[32]} {addr_wr_out[33]} {addr_wr_out[34]} {addr_wr_out[35]} {addr_wr_out[36]} {addr_wr_out[37]} {addr_wr_out[38]} {addr_wr_out[39]} {addr_wr_out[40]} {addr_wr_out[41]} {addr_wr_out[42]} {addr_wr_out[43]} {addr_wr_out[44]} {addr_wr_out[45]} {addr_wr_out[46]} {addr_wr_out[47]} {addr_wr_out[48]} {addr_wr_out[49]} {addr_wr_out[50]} {addr_wr_out[51]} {addr_wr_out[52]} {addr_wr_out[53]} {addr_wr_out[54]} {addr_wr_out[55]} {addr_wr_out[56]} {addr_wr_out[57]} {addr_wr_out[58]} {addr_wr_out[59]} {addr_wr_out[60]} {addr_wr_out[61]} {addr_wr_out[62]} {addr_wr_out[63]}}
setPinAssignMode -pinEditInBatch true
editPin -pinWidth 0.14 -pinDepth 0.14 -fixOverlap 1 -spreadDirection clockwise -side Top -layer 4 -spreadType side -pin {{g_out[0]} {g_out[1]} {g_out[2]} {g_out[3]} {g_out[4]} {g_out[5]} {g_out[6]} {g_out[7]} {g_out[8]} {g_out[9]} {g_out[10]} {g_out[11]} {g_out[12]} {g_out[13]} {g_out[14]} {g_out[15]} {g_out[16]} {g_out[17]} {g_out[18]} {g_out[19]} {g_out[20]} {g_out[21]} {g_out[22]} {g_out[23]} {g_out[24]} {g_out[25]} {g_out[26]} {g_out[27]} {g_out[28]} {g_out[29]} {g_out[30]} {g_out[31]} {g_out[32]} {g_out[33]} {g_out[34]} {g_out[35]} {g_out[36]} {g_out[37]} {g_out[38]} {g_out[39]} {g_out[40]} {g_out[41]} {g_out[42]} {g_out[43]} {g_out[44]} {g_out[45]} {g_out[46]} {g_out[47]} {g_out[48]} {g_out[49]} {g_out[50]} {g_out[51]} {g_out[52]} {g_out[53]} {g_out[54]} {g_out[55]} {g_out[56]} {g_out[57]} {g_out[58]} {g_out[59]} {g_out[60]} {g_out[61]} {g_out[62]} {g_out[63]} {g_out[64]} {g_out[65]} {g_out[66]} {g_out[67]} {g_out[68]} {g_out[69]} {g_out[70]} {g_out[71]} {g_out[72]} {g_out[73]} {g_out[74]} {g_out[75]} {g_out[76]} {g_out[77]} {g_out[78]} {g_out[79]} {g_out[80]} {g_out[81]} {g_out[82]} {g_out[83]} {g_out[84]} {g_out[85]} {g_out[86]} {g_out[87]} {g_out[88]} {g_out[89]} {g_out[90]} {g_out[91]} {g_out[92]} {g_out[93]} {g_out[94]} {g_out[95]} {g_out[96]} {g_out[97]} {g_out[98]} {g_out[99]} {g_out[100]} {g_out[101]} {g_out[102]} {g_out[103]} {g_out[104]} {g_out[105]} {g_out[106]} {g_out[107]} {g_out[108]} {g_out[109]} {g_out[110]} {g_out[111]} {g_out[112]} {g_out[113]} {g_out[114]} {g_out[115]} {g_out[116]} {g_out[117]} {g_out[118]} {g_out[119]} {g_out[120]} {g_out[121]} {g_out[122]} {g_out[123]} {g_out[124]} {g_out[125]} {g_out[126]} {g_out[127]}}
setPinAssignMode -pinEditInBatch true
editPin -pinWidth 0.14 -pinDepth 0.14 -fixOverlap 1 -spreadDirection clockwise -side Bottom -layer 4 -spreadType side -pin {{lambda_out[0]} {lambda_out[1]} {lambda_out[2]} {lambda_out[3]} {lambda_out[4]} {lambda_out[5]} {lambda_out[6]} {lambda_out[7]} {lambda_out[8]} {lambda_out[9]} {lambda_out[10]} {lambda_out[11]} {lambda_out[12]} {lambda_out[13]} {lambda_out[14]} {lambda_out[15]} {lambda_out[16]} {lambda_out[17]} {lambda_out[18]} {lambda_out[19]} {lambda_out[20]} {lambda_out[21]} {lambda_out[22]} {lambda_out[23]} {lambda_out[24]} {lambda_out[25]} {lambda_out[26]} {lambda_out[27]} {lambda_out[28]} {lambda_out[29]} {lambda_out[30]} {lambda_out[31]} {lambda_out[32]} {lambda_out[33]} {lambda_out[34]} {lambda_out[35]} {lambda_out[36]} {lambda_out[37]} {lambda_out[38]} {lambda_out[39]} {lambda_out[40]} {lambda_out[41]} {lambda_out[42]} {lambda_out[43]} {lambda_out[44]} {lambda_out[45]} {lambda_out[46]} {lambda_out[47]} {lambda_out[48]} {lambda_out[49]} {lambda_out[50]} {lambda_out[51]} {lambda_out[52]} {lambda_out[53]} {lambda_out[54]} {lambda_out[55]} {lambda_out[56]} {lambda_out[57]} {lambda_out[58]} {lambda_out[59]} {lambda_out[60]} {lambda_out[61]} {lambda_out[62]} {lambda_out[63]} {lambda_out[64]} {lambda_out[65]} {lambda_out[66]} {lambda_out[67]} {lambda_out[68]} {lambda_out[69]} {lambda_out[70]} {lambda_out[71]} {lambda_out[72]} {lambda_out[73]} {lambda_out[74]} {lambda_out[75]} {lambda_out[76]} {lambda_out[77]} {lambda_out[78]} {lambda_out[79]} {lambda_out[80]} {lambda_out[81]} {lambda_out[82]} {lambda_out[83]} {lambda_out[84]} {lambda_out[85]} {lambda_out[86]} {lambda_out[87]} {lambda_out[88]} {lambda_out[89]} {lambda_out[90]} {lambda_out[91]} {lambda_out[92]} {lambda_out[93]} {lambda_out[94]} {lambda_out[95]} {lambda_out[96]} {lambda_out[97]} {lambda_out[98]} {lambda_out[99]} {lambda_out[100]} {lambda_out[101]} {lambda_out[102]} {lambda_out[103]} {lambda_out[104]} {lambda_out[105]} {lambda_out[106]} {lambda_out[107]} {lambda_out[108]} {lambda_out[109]} {lambda_out[110]} {lambda_out[111]} {lambda_out[112]} {lambda_out[113]} {lambda_out[114]} {lambda_out[115]} {lambda_out[116]} {lambda_out[117]} {lambda_out[118]} {lambda_out[119]} {lambda_out[120]} {lambda_out[121]} {lambda_out[122]} {lambda_out[123]} {lambda_out[124]} {lambda_out[125]} {lambda_out[126]} {lambda_out[127]}}
setPinAssignMode -pinEditInBatch true
editPin -pinWidth 0.14 -pinDepth 0.14 -fixOverlap 1 -spreadDirection clockwise -side Top -layer 2 -spreadType side -pin {{n_out[0]} {n_out[1]} {n_out[2]} {n_out[3]} {n_out[4]} {n_out[5]} {n_out[6]} {n_out[7]} {n_out[8]} {n_out[9]} {n_out[10]} {n_out[11]} {n_out[12]} {n_out[13]} {n_out[14]} {n_out[15]} {n_out[16]} {n_out[17]} {n_out[18]} {n_out[19]} {n_out[20]} {n_out[21]} {n_out[22]} {n_out[23]} {n_out[24]} {n_out[25]} {n_out[26]} {n_out[27]} {n_out[28]} {n_out[29]} {n_out[30]} {n_out[31]} {n_out[32]} {n_out[33]} {n_out[34]} {n_out[35]} {n_out[36]} {n_out[37]} {n_out[38]} {n_out[39]} {n_out[40]} {n_out[41]} {n_out[42]} {n_out[43]} {n_out[44]} {n_out[45]} {n_out[46]} {n_out[47]} {n_out[48]} {n_out[49]} {n_out[50]} {n_out[51]} {n_out[52]} {n_out[53]} {n_out[54]} {n_out[55]} {n_out[56]} {n_out[57]} {n_out[58]} {n_out[59]} {n_out[60]} {n_out[61]} {n_out[62]} {n_out[63]} {n_out[64]} {n_out[65]} {n_out[66]} {n_out[67]} {n_out[68]} {n_out[69]} {n_out[70]} {n_out[71]} {n_out[72]} {n_out[73]} {n_out[74]} {n_out[75]} {n_out[76]} {n_out[77]} {n_out[78]} {n_out[79]} {n_out[80]} {n_out[81]} {n_out[82]} {n_out[83]} {n_out[84]} {n_out[85]} {n_out[86]} {n_out[87]} {n_out[88]} {n_out[89]} {n_out[90]} {n_out[91]} {n_out[92]} {n_out[93]} {n_out[94]} {n_out[95]} {n_out[96]} {n_out[97]} {n_out[98]} {n_out[99]} {n_out[100]} {n_out[101]} {n_out[102]} {n_out[103]} {n_out[104]} {n_out[105]} {n_out[106]} {n_out[107]} {n_out[108]} {n_out[109]} {n_out[110]} {n_out[111]} {n_out[112]} {n_out[113]} {n_out[114]} {n_out[115]} {n_out[116]} {n_out[117]} {n_out[118]} {n_out[119]} {n_out[120]} {n_out[121]} {n_out[122]} {n_out[123]} {n_out[124]} {n_out[125]} {n_out[126]} {n_out[127]}}
setPinAssignMode -pinEditInBatch true
editPin -pinWidth 0.14 -pinDepth 0.14 -fixOverlap 1 -spreadDirection clockwise -side Top -layer 4 -spreadType side -pin {{p[0]} {p[1]} {p[2]} {p[3]} {p[4]} {p[5]} {p[6]} {p[7]} {p[8]} {p[9]} {p[10]} {p[11]} {p[12]} {p[13]} {p[14]} {p[15]} {p[16]} {p[17]} {p[18]} {p[19]} {p[20]} {p[21]} {p[22]} {p[23]} {p[24]} {p[25]} {p[26]} {p[27]} {p[28]} {p[29]} {p[30]} {p[31]} {p[32]} {p[33]} {p[34]} {p[35]} {p[36]} {p[37]} {p[38]} {p[39]} {p[40]} {p[41]} {p[42]} {p[43]} {p[44]} {p[45]} {p[46]} {p[47]} {p[48]} {p[49]} {p[50]} {p[51]} {p[52]} {p[53]} {p[54]} {p[55]} {p[56]} {p[57]} {p[58]} {p[59]} {p[60]} {p[61]} {p[62]} {p[63]}}
setPinAssignMode -pinEditInBatch true
editPin -pinWidth 0.14 -pinDepth 0.14 -fixOverlap 1 -spreadDirection clockwise -side Top -layer 6 -spreadType side -pin {{q[0]} {q[1]} {q[2]} {q[3]} {q[4]} {q[5]} {q[6]} {q[7]} {q[8]} {q[9]} {q[10]} {q[11]} {q[12]} {q[13]} {q[14]} {q[15]} {q[16]} {q[17]} {q[18]} {q[19]} {q[20]} {q[21]} {q[22]} {q[23]} {q[24]} {q[25]} {q[26]} {q[27]} {q[28]} {q[29]} {q[30]} {q[31]} {q[32]} {q[33]} {q[34]} {q[35]} {q[36]} {q[37]} {q[38]} {q[39]} {q[40]} {q[41]} {q[42]} {q[43]} {q[44]} {q[45]} {q[46]} {q[47]} {q[48]} {q[49]} {q[50]} {q[51]} {q[52]} {q[53]} {q[54]} {q[55]} {q[56]} {q[57]} {q[58]} {q[59]} {q[60]} {q[61]} {q[62]} {q[63]}}
setPinAssignMode -pinEditInBatch true
editPin -pinWidth 0.14 -pinDepth 0.14 -fixOverlap 1 -spreadDirection clockwise -side Right -layer 6 -spreadType side -pin {{u_out[0]} {u_out[1]} {u_out[2]} {u_out[3]} {u_out[4]} {u_out[5]} {u_out[6]} {u_out[7]} {u_out[8]} {u_out[9]} {u_out[10]} {u_out[11]} {u_out[12]} {u_out[13]} {u_out[14]} {u_out[15]} {u_out[16]} {u_out[17]} {u_out[18]} {u_out[19]} {u_out[20]} {u_out[21]} {u_out[22]} {u_out[23]} {u_out[24]} {u_out[25]} {u_out[26]} {u_out[27]} {u_out[28]} {u_out[29]} {u_out[30]} {u_out[31]} {u_out[32]} {u_out[33]} {u_out[34]} {u_out[35]} {u_out[36]} {u_out[37]} {u_out[38]} {u_out[39]} {u_out[40]} {u_out[41]} {u_out[42]} {u_out[43]} {u_out[44]} {u_out[45]} {u_out[46]} {u_out[47]} {u_out[48]} {u_out[49]} {u_out[50]} {u_out[51]} {u_out[52]} {u_out[53]} {u_out[54]} {u_out[55]} {u_out[56]} {u_out[57]} {u_out[58]} {u_out[59]} {u_out[60]} {u_out[61]} {u_out[62]} {u_out[63]} {u_out[64]} {u_out[65]} {u_out[66]} {u_out[67]} {u_out[68]} {u_out[69]} {u_out[70]} {u_out[71]} {u_out[72]} {u_out[73]} {u_out[74]} {u_out[75]} {u_out[76]} {u_out[77]} {u_out[78]} {u_out[79]} {u_out[80]} {u_out[81]} {u_out[82]} {u_out[83]} {u_out[84]} {u_out[85]} {u_out[86]} {u_out[87]} {u_out[88]} {u_out[89]} {u_out[90]} {u_out[91]} {u_out[92]} {u_out[93]} {u_out[94]} {u_out[95]} {u_out[96]} {u_out[97]} {u_out[98]} {u_out[99]} {u_out[100]} {u_out[101]} {u_out[102]} {u_out[103]} {u_out[104]} {u_out[105]} {u_out[106]} {u_out[107]} {u_out[108]} {u_out[109]} {u_out[110]} {u_out[111]} {u_out[112]} {u_out[113]} {u_out[114]} {u_out[115]} {u_out[116]} {u_out[117]} {u_out[118]} {u_out[119]} {u_out[120]} {u_out[121]} {u_out[122]} {u_out[123]} {u_out[124]} {u_out[125]} {u_out[126]} {u_out[127]}}
pan -111.794 16.928
pan 0.863 1.849
setPinAssignMode -pinEditInBatch true
editPin -pinWidth 0.14 -pinDepth 0.14 -fixOverlap 1 -spreadDirection clockwise -side Right -layer 6 -spreadType side -pin {{u_out[0]} {u_out[1]} {u_out[2]} {u_out[3]} {u_out[4]} {u_out[5]} {u_out[6]} {u_out[7]} {u_out[8]} {u_out[9]} {u_out[10]} {u_out[11]} {u_out[12]} {u_out[13]} {u_out[14]} {u_out[15]} {u_out[16]} {u_out[17]} {u_out[18]} {u_out[19]} {u_out[20]} {u_out[21]} {u_out[22]} {u_out[23]} {u_out[24]} {u_out[25]} {u_out[26]} {u_out[27]} {u_out[28]} {u_out[29]} {u_out[30]} {u_out[31]} {u_out[32]} {u_out[33]} {u_out[34]} {u_out[35]} {u_out[36]} {u_out[37]} {u_out[38]} {u_out[39]} {u_out[40]} {u_out[41]} {u_out[42]} {u_out[43]} {u_out[44]} {u_out[45]} {u_out[46]} {u_out[47]} {u_out[48]} {u_out[49]} {u_out[50]} {u_out[51]} {u_out[52]} {u_out[53]} {u_out[54]} {u_out[55]} {u_out[56]} {u_out[57]} {u_out[58]} {u_out[59]} {u_out[60]} {u_out[61]} {u_out[62]} {u_out[63]} {u_out[64]} {u_out[65]} {u_out[66]} {u_out[67]} {u_out[68]} {u_out[69]} {u_out[70]} {u_out[71]} {u_out[72]} {u_out[73]} {u_out[74]} {u_out[75]} {u_out[76]} {u_out[77]} {u_out[78]} {u_out[79]} {u_out[80]} {u_out[81]} {u_out[82]} {u_out[83]} {u_out[84]} {u_out[85]} {u_out[86]} {u_out[87]} {u_out[88]} {u_out[89]} {u_out[90]} {u_out[91]} {u_out[92]} {u_out[93]} {u_out[94]} {u_out[95]} {u_out[96]} {u_out[97]} {u_out[98]} {u_out[99]} {u_out[100]} {u_out[101]} {u_out[102]} {u_out[103]} {u_out[104]} {u_out[105]} {u_out[106]} {u_out[107]} {u_out[108]} {u_out[109]} {u_out[110]} {u_out[111]} {u_out[112]} {u_out[113]} {u_out[114]} {u_out[115]} {u_out[116]} {u_out[117]} {u_out[118]} {u_out[119]} {u_out[120]} {u_out[121]} {u_out[122]} {u_out[123]} {u_out[124]} {u_out[125]} {u_out[126]} {u_out[127]}}
setPinAssignMode -pinEditInBatch false
saveDesign Top_place.enc
floorPlan -r 1.0 0.6 2 2 2 2
uiSetTool select
getIoFlowFlag
globalNetConnect VDD -type pgpin -pin VDD -inst *
globalNetConnect VSS -type pgpin -pin VSS -inst *
globalNetConnect VDD -type tiehi
globalNetConnect VSS -type tielo
saveDesign Top.enc
addRing -nets {VSS VDD} -type core_rings -follow io -layer {top metal5 bottom metal5 left metal4 right metal4} -width {top 1 bottom 1 left 1 right 1} -spacing {top 1 bottom 1 left 1 right 1} -offset {top 0 bottom 0 left 0 right 0} -center 0 -extend_corner {} -threshold 0 -jog_distance 0 -snap_wire_center_to_grid None
addStripe -block_ring_top_layer_limit metal5 -max_same_layer_jog_length 1.6 -padcore_ring_bottom_layer_limit metal3 -set_to_set_distance 5 -stacked_via_top_layer metal10 -padcore_ring_top_layer_limit metal5 -spacing 1 -xleft_offset 1 -merge_stripes_value 0.095 -layer metal4 -block_ring_bottom_layer_limit metal3 -width 1 -nets {VSS VDD} -stacked_via_bottom_layer metal1
sroute -connect { blockPin padPin padRing corePin floatingStripe } -layerChangeRange { 1 10 } -blockPinTarget {nearestRingStripe nearestTarget } -padPinPortConnect { allPort oneGeom } -checkAlignedSecondaryPin 1 -blockPin useLef -allowJogging 1 -crossoverViaBottomLayer 1 -allowLayerChange 1 -targetViaTopLayer 10 -crossoverViaTopLayer 10 -targetViaBottomLayer 1 -nets { VDD VSS }
saveDesign Top_power.enc
editPowerVia -skip_via_on_pin Standardcell -bottom_layer metal1 -add_vias 1 -top_layer metal8
setEndCapMode -reset
setEndCapMode -boundary_tap false
setPlaceMode -reset
setPlaceMode -congEffort auto -timingDriven 1 -modulePlan 1 -clkGateAware 1 -powerDriven 0 -ignoreScan 1 -reorderScan 1 -ignoreSpare 0 -placeIOPins 0 -moduleAwareSpare 0 -preserveRouting 0 -rmAffectedRouting 0 -checkRoute 0 -swapEEQ 0
setPlaceMode -fp false
placeDesign
timeDesign -preCTS -numPaths 200
optDesign -preCTS -numPaths 200
setDrawView place
uiSetTool ruler
pan 0.159 1.441
pan -0.330 -0.022
pan 0.778 -2.056
pan 2.131 2.289
pan 0.007 -0.213
pan 26.424 -0.786
pan 20.396 -1.878
pan 29.655 0.262
pan 27.253 -0.786
pan 27.297 -0.262
pan 130.668 -1.109
pan -29.643 -6.599
pan -24.848 -0.052
pan -21.291 -0.567
pan -25.673 -2.268
pan -26.137 -0.154
pan -25.931 0.722
pan -32.581 -0.052
pan -39.953 1.083
pan -38.097 0.052
pan -17.218 -2.010
pan -1.026 -0.112
pan 2.082 -5.104
pan 42.520 -368.784
pan 0.672 -0.206
pan 2.563 1.342
pan -0.794 -6.385
pan 63.151 197.186
saveDesign Top_place.enc
set_ccopt_property update_io_latency false
clockDesign -specFile Clock.ctstch -outDir clock_report
checkPlace key_generation.checkPlace
timeDesign -postCTS -numPaths 200
timeDesign -postCTS -hold -numPaths 200
optDesign -postCTS -numPaths 200
optDesign -postCTS -hold -numPaths 200
timeDesign -postCTS -hold -numPaths 200
timeDesign -postCTS -numPaths 200
saveDesign Top_clk.enc
getFillerMode -quiet
addFillerGap 0.6
addFiller -cell FILLCELL_X1 FILLCELL_X2 FILLCELL_X4 FILLCELL_X8 -prefix FILLER -markFixed
saveDesign Top_powerroute_clk_filler.enc
setAnalysisMode -cppr none -clockGatingCheck true -timeBorrowing true -useOutputPinCap true -sequentialConstProp false -timingSelfLoopsNoSkew false -enableMultipleDriveNet true -clkSrcPath true -warn true -usefulSkew false -analysisType onChipVariation -log true
setNanoRouteMode -quiet -drouteFixAntenna false
setNanoRouteMode -quiet -routeTopRoutingLayer default
setNanoRouteMode -quiet -routeBottomRoutingLayer default
setNanoRouteMode -quiet -drouteEndIteration default
setNanoRouteMode -quiet -routeWithTimingDriven false
setNanoRouteMode -quiet -routeWithSiDriven false
setNanoRouteMode -quiet -routeTopRoutingLayer 6
routeDesign -globalDetail
saveDesign Top_conv _powerroute_clk_filler.enc
timeDesign -postRoute -pathReports -drvReports -slackReports -numPaths 400 -prefix Top_postRoute -outDir timingReports
clearClockDomains
timeDesign -postRoute -hold -pathReports -slackReports -numPaths 400 -prefix Top_postRoute -outDir timingReports
saveDesign Top_final_layout.enc
saveNetlist -phys -includePowerGround Top_phy.v -excludeLeafCell
saveNetlist Top_nophy.v -excludeLeafCell
write_sdf Top_conv.sd
verify_drc -report cnn.drc.rpt -limit 1000
verifyConnectivity -type all -error 1000 -warning 50
verifyProcessAntenna -reportfile cnn.antenna.rpt -error 1000
pan 59.596 -85.359
pan -15.688 9.120
pan -6.380 1.502
setLayerPreference allM0 -isVisible 0
setLayerPreference allM1 -isVisible 0
setLayerPreference allM2Cont -isVisible 0
setLayerPreference allM2 -isVisible 0
setLayerPreference allM3Cont -isVisible 0
setLayerPreference allM3 -isVisible 0
setLayerPreference allM4Cont -isVisible 0
setLayerPreference allM4 -isVisible 0
setLayerPreference allM5Cont -isVisible 0
setLayerPreference allM5 -isVisible 0
setLayerPreference allM6Cont -isVisible 0
setLayerPreference allM6 -isVisible 0
setLayerPreference allM7Cont -isVisible 0
setLayerPreference allM7 -isVisible 0
setLayerPreference allM8Cont -isVisible 0
setLayerPreference allM8 -isVisible 0
setLayerPreference allM9Cont -isVisible 0
setLayerPreference allM9 -isVisible 0
setLayerPreference allM10Cont -isVisible 0
setLayerPreference allM10 -isVisible 0
pan -182.970 -3.538
pan 8.623 3.688
pan 4.002 12.471
pan 35.166 4.981
pan 116.608 -1.526
pan 57.827 1.909
pan -26.866 12.893
pan -86.511 -3.056
pan -125.819 4.943
setLayerPreference netRect -isVisible 1
setLayerPreference netRect -isVisible 0
setLayerPreference allM10 -isVisible 1
setLayerPreference allM10 -isVisible 0
setLayerPreference allM10 -isVisible 1
pan 39.349 -4.966
pan 22.791 -169.160
uiSetTool select
gui_select -rect {274.565 250.481 274.367 249.667}
selectMarker 0.0000 -0.2900 274.5500 273.0000 -1 3 7
getPinAssignMode -pinEditInBatch -quiet
setPinAssignMode -pinEditInBatch true
editPin -pinWidth 0.07 -pinDepth 0.07 -fixOverlap 1 -unit MICRON -spreadDirection clockwise -side Top -layer 3 -spreadType center -spacing -0.28 -pin {{addr_rd_out[0]} {addr_rd_out[1]} {addr_rd_out[2]} {addr_rd_out[3]} {addr_rd_out[4]} {addr_rd_out[5]} {addr_rd_out[6]} {addr_rd_out[7]} {addr_rd_out[8]} {addr_rd_out[9]} {addr_rd_out[10]} {addr_rd_out[11]} {addr_rd_out[12]} {addr_rd_out[13]} {addr_rd_out[14]} {addr_rd_out[15]} {addr_rd_out[16]} {addr_rd_out[17]} {addr_rd_out[18]} {addr_rd_out[19]} {addr_rd_out[20]} {addr_rd_out[21]} {addr_rd_out[22]} {addr_rd_out[23]} {addr_rd_out[24]} {addr_rd_out[25]} {addr_rd_out[26]} {addr_rd_out[27]} {addr_rd_out[28]} {addr_rd_out[29]} {addr_rd_out[30]} {addr_rd_out[31]} {addr_rd_out[32]} {addr_rd_out[33]} {addr_rd_out[34]} {addr_rd_out[35]} {addr_rd_out[36]} {addr_rd_out[37]} {addr_rd_out[38]} {addr_rd_out[39]} {addr_rd_out[40]} {addr_rd_out[41]} {addr_rd_out[42]} {addr_rd_out[43]} {addr_rd_out[44]} {addr_rd_out[45]} {addr_rd_out[46]} {addr_rd_out[47]} {addr_rd_out[48]} {addr_rd_out[49]} {addr_rd_out[50]} {addr_rd_out[51]} {addr_rd_out[52]} {addr_rd_out[53]} {addr_rd_out[54]} {addr_rd_out[55]} {addr_rd_out[56]} {addr_rd_out[57]} {addr_rd_out[58]} {addr_rd_out[59]} {addr_rd_out[60]} {addr_rd_out[61]} {addr_rd_out[62]} {addr_rd_out[63]}}
setPinAssignMode -pinEditInBatch true
editPin -pinWidth 0.07 -pinDepth 0.07 -fixOverlap 1 -unit MICRON -spreadDirection clockwise -side Top -layer 3 -spreadType center -spacing 0.56 -pin {{addr_rd_out[0]} {addr_rd_out[1]} {addr_rd_out[2]} {addr_rd_out[3]} {addr_rd_out[4]} {addr_rd_out[5]} {addr_rd_out[6]} {addr_rd_out[7]} {addr_rd_out[8]} {addr_rd_out[9]} {addr_rd_out[10]} {addr_rd_out[11]} {addr_rd_out[12]} {addr_rd_out[13]} {addr_rd_out[14]} {addr_rd_out[15]} {addr_rd_out[16]} {addr_rd_out[17]} {addr_rd_out[18]} {addr_rd_out[19]} {addr_rd_out[20]} {addr_rd_out[21]} {addr_rd_out[22]} {addr_rd_out[23]} {addr_rd_out[24]} {addr_rd_out[25]} {addr_rd_out[26]} {addr_rd_out[27]} {addr_rd_out[28]} {addr_rd_out[29]} {addr_rd_out[30]} {addr_rd_out[31]} {addr_rd_out[32]} {addr_rd_out[33]} {addr_rd_out[34]} {addr_rd_out[35]} {addr_rd_out[36]} {addr_rd_out[37]} {addr_rd_out[38]} {addr_rd_out[39]} {addr_rd_out[40]} {addr_rd_out[41]} {addr_rd_out[42]} {addr_rd_out[43]} {addr_rd_out[44]} {addr_rd_out[45]} {addr_rd_out[46]} {addr_rd_out[47]} {addr_rd_out[48]} {addr_rd_out[49]} {addr_rd_out[50]} {addr_rd_out[51]} {addr_rd_out[52]} {addr_rd_out[53]} {addr_rd_out[54]} {addr_rd_out[55]} {addr_rd_out[56]} {addr_rd_out[57]} {addr_rd_out[58]} {addr_rd_out[59]} {addr_rd_out[60]} {addr_rd_out[61]} {addr_rd_out[62]} {addr_rd_out[63]}}
setPinAssignMode -pinEditInBatch true
editPin -pinWidth 0.07 -pinDepth 0.07 -fixOverlap 1 -unit MICRON -spreadDirection clockwise -side Left -layer 3 -spreadType center -spacing 0.56 -pin {{addr_wr_out[0]} {addr_wr_out[1]} {addr_wr_out[2]} {addr_wr_out[3]} {addr_wr_out[4]} {addr_wr_out[5]} {addr_wr_out[6]} {addr_wr_out[7]} {addr_wr_out[8]} {addr_wr_out[9]} {addr_wr_out[10]} {addr_wr_out[11]} {addr_wr_out[12]} {addr_wr_out[13]} {addr_wr_out[14]} {addr_wr_out[15]} {addr_wr_out[16]} {addr_wr_out[17]} {addr_wr_out[18]} {addr_wr_out[19]} {addr_wr_out[20]} {addr_wr_out[21]} {addr_wr_out[22]} {addr_wr_out[23]} {addr_wr_out[24]} {addr_wr_out[25]} {addr_wr_out[26]} {addr_wr_out[27]} {addr_wr_out[28]} {addr_wr_out[29]} {addr_wr_out[30]} {addr_wr_out[31]} {addr_wr_out[32]} {addr_wr_out[33]} {addr_wr_out[34]} {addr_wr_out[35]} {addr_wr_out[36]} {addr_wr_out[37]} {addr_wr_out[38]} {addr_wr_out[39]} {addr_wr_out[40]} {addr_wr_out[41]} {addr_wr_out[42]} {addr_wr_out[43]} {addr_wr_out[44]} {addr_wr_out[45]} {addr_wr_out[46]} {addr_wr_out[47]} {addr_wr_out[48]} {addr_wr_out[49]} {addr_wr_out[50]} {addr_wr_out[51]} {addr_wr_out[52]} {addr_wr_out[53]} {addr_wr_out[54]} {addr_wr_out[55]} {addr_wr_out[56]} {addr_wr_out[57]} {addr_wr_out[58]} {addr_wr_out[59]} {addr_wr_out[60]} {addr_wr_out[61]} {addr_wr_out[62]} {addr_wr_out[63]}}
setPinAssignMode -pinEditInBatch true
editPin -pinWidth 0.14 -pinDepth 0.14 -fixOverlap 1 -unit MICRON -spreadDirection clockwise -side Top -layer 4 -spreadType center -spacing 0.28 -pin {{g_out[0]} {g_out[1]} {g_out[2]} {g_out[3]} {g_out[4]} {g_out[5]} {g_out[6]} {g_out[7]} {g_out[8]} {g_out[9]} {g_out[10]} {g_out[11]} {g_out[12]} {g_out[13]} {g_out[14]} {g_out[15]} {g_out[16]} {g_out[17]} {g_out[18]} {g_out[19]} {g_out[20]} {g_out[21]} {g_out[22]} {g_out[23]} {g_out[24]} {g_out[25]} {g_out[26]} {g_out[27]} {g_out[28]} {g_out[29]} {g_out[30]} {g_out[31]} {g_out[32]} {g_out[33]} {g_out[34]} {g_out[35]} {g_out[36]} {g_out[37]} {g_out[38]} {g_out[39]} {g_out[40]} {g_out[41]} {g_out[42]} {g_out[43]} {g_out[44]} {g_out[45]} {g_out[46]} {g_out[47]} {g_out[48]} {g_out[49]} {g_out[50]} {g_out[51]} {g_out[52]} {g_out[53]} {g_out[54]} {g_out[55]} {g_out[56]} {g_out[57]} {g_out[58]} {g_out[59]} {g_out[60]} {g_out[61]} {g_out[62]} {g_out[63]} {g_out[64]} {g_out[65]} {g_out[66]} {g_out[67]} {g_out[68]} {g_out[69]} {g_out[70]} {g_out[71]} {g_out[72]} {g_out[73]} {g_out[74]} {g_out[75]} {g_out[76]} {g_out[77]} {g_out[78]} {g_out[79]} {g_out[80]} {g_out[81]} {g_out[82]} {g_out[83]} {g_out[84]} {g_out[85]} {g_out[86]} {g_out[87]} {g_out[88]} {g_out[89]} {g_out[90]} {g_out[91]} {g_out[92]} {g_out[93]} {g_out[94]} {g_out[95]} {g_out[96]} {g_out[97]} {g_out[98]} {g_out[99]} {g_out[100]} {g_out[101]} {g_out[102]} {g_out[103]} {g_out[104]} {g_out[105]} {g_out[106]} {g_out[107]} {g_out[108]} {g_out[109]} {g_out[110]} {g_out[111]} {g_out[112]} {g_out[113]} {g_out[114]} {g_out[115]} {g_out[116]} {g_out[117]} {g_out[118]} {g_out[119]} {g_out[120]} {g_out[121]} {g_out[122]} {g_out[123]} {g_out[124]} {g_out[125]} {g_out[126]} {g_out[127]}}
setPinAssignMode -pinEditInBatch true
editPin -pinWidth 0.14 -pinDepth 0.14 -fixOverlap 1 -unit MICRON -spreadDirection clockwise -side Top -layer 4 -spreadType center -spacing 0.56 -pin {{g_out[0]} {g_out[1]} {g_out[2]} {g_out[3]} {g_out[4]} {g_out[5]} {g_out[6]} {g_out[7]} {g_out[8]} {g_out[9]} {g_out[10]} {g_out[11]} {g_out[12]} {g_out[13]} {g_out[14]} {g_out[15]} {g_out[16]} {g_out[17]} {g_out[18]} {g_out[19]} {g_out[20]} {g_out[21]} {g_out[22]} {g_out[23]} {g_out[24]} {g_out[25]} {g_out[26]} {g_out[27]} {g_out[28]} {g_out[29]} {g_out[30]} {g_out[31]} {g_out[32]} {g_out[33]} {g_out[34]} {g_out[35]} {g_out[36]} {g_out[37]} {g_out[38]} {g_out[39]} {g_out[40]} {g_out[41]} {g_out[42]} {g_out[43]} {g_out[44]} {g_out[45]} {g_out[46]} {g_out[47]} {g_out[48]} {g_out[49]} {g_out[50]} {g_out[51]} {g_out[52]} {g_out[53]} {g_out[54]} {g_out[55]} {g_out[56]} {g_out[57]} {g_out[58]} {g_out[59]} {g_out[60]} {g_out[61]} {g_out[62]} {g_out[63]} {g_out[64]} {g_out[65]} {g_out[66]} {g_out[67]} {g_out[68]} {g_out[69]} {g_out[70]} {g_out[71]} {g_out[72]} {g_out[73]} {g_out[74]} {g_out[75]} {g_out[76]} {g_out[77]} {g_out[78]} {g_out[79]} {g_out[80]} {g_out[81]} {g_out[82]} {g_out[83]} {g_out[84]} {g_out[85]} {g_out[86]} {g_out[87]} {g_out[88]} {g_out[89]} {g_out[90]} {g_out[91]} {g_out[92]} {g_out[93]} {g_out[94]} {g_out[95]} {g_out[96]} {g_out[97]} {g_out[98]} {g_out[99]} {g_out[100]} {g_out[101]} {g_out[102]} {g_out[103]} {g_out[104]} {g_out[105]} {g_out[106]} {g_out[107]} {g_out[108]} {g_out[109]} {g_out[110]} {g_out[111]} {g_out[112]} {g_out[113]} {g_out[114]} {g_out[115]} {g_out[116]} {g_out[117]} {g_out[118]} {g_out[119]} {g_out[120]} {g_out[121]} {g_out[122]} {g_out[123]} {g_out[124]} {g_out[125]} {g_out[126]} {g_out[127]}}
setPinAssignMode -pinEditInBatch true
editPin -pinWidth 0.14 -pinDepth 0.14 -fixOverlap 1 -unit MICRON -spreadDirection clockwise -side Bottom -layer 4 -spreadType center -spacing 0.56 -pin {{lambda_out[0]} {lambda_out[1]} {lambda_out[2]} {lambda_out[3]} {lambda_out[4]} {lambda_out[5]} {lambda_out[6]} {lambda_out[7]} {lambda_out[8]} {lambda_out[9]} {lambda_out[10]} {lambda_out[11]} {lambda_out[12]} {lambda_out[13]} {lambda_out[14]} {lambda_out[15]} {lambda_out[16]} {lambda_out[17]} {lambda_out[18]} {lambda_out[19]} {lambda_out[20]} {lambda_out[21]} {lambda_out[22]} {lambda_out[23]} {lambda_out[24]} {lambda_out[25]} {lambda_out[26]} {lambda_out[27]} {lambda_out[28]} {lambda_out[29]} {lambda_out[30]} {lambda_out[31]} {lambda_out[32]} {lambda_out[33]} {lambda_out[34]} {lambda_out[35]} {lambda_out[36]} {lambda_out[37]} {lambda_out[38]} {lambda_out[39]} {lambda_out[40]} {lambda_out[41]} {lambda_out[42]} {lambda_out[43]} {lambda_out[44]} {lambda_out[45]} {lambda_out[46]} {lambda_out[47]} {lambda_out[48]} {lambda_out[49]} {lambda_out[50]} {lambda_out[51]} {lambda_out[52]} {lambda_out[53]} {lambda_out[54]} {lambda_out[55]} {lambda_out[56]} {lambda_out[57]} {lambda_out[58]} {lambda_out[59]} {lambda_out[60]} {lambda_out[61]} {lambda_out[62]} {lambda_out[63]} {lambda_out[64]} {lambda_out[65]} {lambda_out[66]} {lambda_out[67]} {lambda_out[68]} {lambda_out[69]} {lambda_out[70]} {lambda_out[71]} {lambda_out[72]} {lambda_out[73]} {lambda_out[74]} {lambda_out[75]} {lambda_out[76]} {lambda_out[77]} {lambda_out[78]} {lambda_out[79]} {lambda_out[80]} {lambda_out[81]} {lambda_out[82]} {lambda_out[83]} {lambda_out[84]} {lambda_out[85]} {lambda_out[86]} {lambda_out[87]} {lambda_out[88]} {lambda_out[89]} {lambda_out[90]} {lambda_out[91]} {lambda_out[92]} {lambda_out[93]} {lambda_out[94]} {lambda_out[95]} {lambda_out[96]} {lambda_out[97]} {lambda_out[98]} {lambda_out[99]} {lambda_out[100]} {lambda_out[101]} {lambda_out[102]} {lambda_out[103]} {lambda_out[104]} {lambda_out[105]} {lambda_out[106]} {lambda_out[107]} {lambda_out[108]} {lambda_out[109]} {lambda_out[110]} {lambda_out[111]} {lambda_out[112]} {lambda_out[113]} {lambda_out[114]} {lambda_out[115]} {lambda_out[116]} {lambda_out[117]} {lambda_out[118]} {lambda_out[119]} {lambda_out[120]} {lambda_out[121]} {lambda_out[122]} {lambda_out[123]} {lambda_out[124]} {lambda_out[125]} {lambda_out[126]} {lambda_out[127]}}
setPinAssignMode -pinEditInBatch true
editPin -pinWidth 0.14 -pinDepth 0.14 -fixOverlap 1 -unit MICRON -spreadDirection clockwise -side Top -layer 2 -spreadType center -spacing 0.56 -pin {{n_out[0]} {n_out[1]} {n_out[2]} {n_out[3]} {n_out[4]} {n_out[5]} {n_out[6]} {n_out[7]} {n_out[8]} {n_out[9]} {n_out[10]} {n_out[11]} {n_out[12]} {n_out[13]} {n_out[14]} {n_out[15]} {n_out[16]} {n_out[17]} {n_out[18]} {n_out[19]} {n_out[20]} {n_out[21]} {n_out[22]} {n_out[23]} {n_out[24]} {n_out[25]} {n_out[26]} {n_out[27]} {n_out[28]} {n_out[29]} {n_out[30]} {n_out[31]} {n_out[32]} {n_out[33]} {n_out[34]} {n_out[35]} {n_out[36]} {n_out[37]} {n_out[38]} {n_out[39]} {n_out[40]} {n_out[41]} {n_out[42]} {n_out[43]} {n_out[44]} {n_out[45]} {n_out[46]} {n_out[47]} {n_out[48]} {n_out[49]} {n_out[50]} {n_out[51]} {n_out[52]} {n_out[53]} {n_out[54]} {n_out[55]} {n_out[56]} {n_out[57]} {n_out[58]} {n_out[59]} {n_out[60]} {n_out[61]} {n_out[62]} {n_out[63]} {n_out[64]} {n_out[65]} {n_out[66]} {n_out[67]} {n_out[68]} {n_out[69]} {n_out[70]} {n_out[71]} {n_out[72]} {n_out[73]} {n_out[74]} {n_out[75]} {n_out[76]} {n_out[77]} {n_out[78]} {n_out[79]} {n_out[80]} {n_out[81]} {n_out[82]} {n_out[83]} {n_out[84]} {n_out[85]} {n_out[86]} {n_out[87]} {n_out[88]} {n_out[89]} {n_out[90]} {n_out[91]} {n_out[92]} {n_out[93]} {n_out[94]} {n_out[95]} {n_out[96]} {n_out[97]} {n_out[98]} {n_out[99]} {n_out[100]} {n_out[101]} {n_out[102]} {n_out[103]} {n_out[104]} {n_out[105]} {n_out[106]} {n_out[107]} {n_out[108]} {n_out[109]} {n_out[110]} {n_out[111]} {n_out[112]} {n_out[113]} {n_out[114]} {n_out[115]} {n_out[116]} {n_out[117]} {n_out[118]} {n_out[119]} {n_out[120]} {n_out[121]} {n_out[122]} {n_out[123]} {n_out[124]} {n_out[125]} {n_out[126]} {n_out[127]}}
setPinAssignMode -pinEditInBatch true
editPin -pinWidth 0.14 -pinDepth 0.14 -fixOverlap 1 -unit MICRON -spreadDirection clockwise -side Top -layer 4 -spreadType center -spacing 0.57 -pin {{p[0]} {p[1]} {p[2]} {p[3]} {p[4]} {p[5]} {p[6]} {p[7]} {p[8]} {p[9]} {p[10]} {p[11]} {p[12]} {p[13]} {p[14]} {p[15]} {p[16]} {p[17]} {p[18]} {p[19]} {p[20]} {p[21]} {p[22]} {p[23]} {p[24]} {p[25]} {p[26]} {p[27]} {p[28]} {p[29]} {p[30]} {p[31]} {p[32]} {p[33]} {p[34]} {p[35]} {p[36]} {p[37]} {p[38]} {p[39]} {p[40]} {p[41]} {p[42]} {p[43]} {p[44]} {p[45]} {p[46]} {p[47]} {p[48]} {p[49]} {p[50]} {p[51]} {p[52]} {p[53]} {p[54]} {p[55]} {p[56]} {p[57]} {p[58]} {p[59]} {p[60]} {p[61]} {p[62]} {p[63]}}
setPinAssignMode -pinEditInBatch true
editPin -pinWidth 0.14 -pinDepth 0.14 -fixOverlap 1 -unit MICRON -spreadDirection clockwise -side Top -layer 6 -spreadType center -spacing 0.57 -pin {{q[0]} {q[1]} {q[2]} {q[3]} {q[4]} {q[5]} {q[6]} {q[7]} {q[8]} {q[9]} {q[10]} {q[11]} {q[12]} {q[13]} {q[14]} {q[15]} {q[16]} {q[17]} {q[18]} {q[19]} {q[20]} {q[21]} {q[22]} {q[23]} {q[24]} {q[25]} {q[26]} {q[27]} {q[28]} {q[29]} {q[30]} {q[31]} {q[32]} {q[33]} {q[34]} {q[35]} {q[36]} {q[37]} {q[38]} {q[39]} {q[40]} {q[41]} {q[42]} {q[43]} {q[44]} {q[45]} {q[46]} {q[47]} {q[48]} {q[49]} {q[50]} {q[51]} {q[52]} {q[53]} {q[54]} {q[55]} {q[56]} {q[57]} {q[58]} {q[59]} {q[60]} {q[61]} {q[62]} {q[63]}}
setPinAssignMode -pinEditInBatch true
editPin -pinWidth 0.14 -pinDepth 0.14 -fixOverlap 1 -unit MICRON -spreadDirection clockwise -side Top -layer 6 -spreadType center -spacing 0.56 -pin {{u_out[0]} {u_out[1]} {u_out[2]} {u_out[3]} {u_out[4]} {u_out[5]} {u_out[6]} {u_out[7]} {u_out[8]} {u_out[9]} {u_out[10]} {u_out[11]} {u_out[12]} {u_out[13]} {u_out[14]} {u_out[15]} {u_out[16]} {u_out[17]} {u_out[18]} {u_out[19]} {u_out[20]} {u_out[21]} {u_out[22]} {u_out[23]} {u_out[24]} {u_out[25]} {u_out[26]} {u_out[27]} {u_out[28]} {u_out[29]} {u_out[30]} {u_out[31]} {u_out[32]} {u_out[33]} {u_out[34]} {u_out[35]} {u_out[36]} {u_out[37]} {u_out[38]} {u_out[39]} {u_out[40]} {u_out[41]} {u_out[42]} {u_out[43]} {u_out[44]} {u_out[45]} {u_out[46]} {u_out[47]} {u_out[48]} {u_out[49]} {u_out[50]} {u_out[51]} {u_out[52]} {u_out[53]} {u_out[54]} {u_out[55]} {u_out[56]} {u_out[57]} {u_out[58]} {u_out[59]} {u_out[60]} {u_out[61]} {u_out[62]} {u_out[63]} {u_out[64]} {u_out[65]} {u_out[66]} {u_out[67]} {u_out[68]} {u_out[69]} {u_out[70]} {u_out[71]} {u_out[72]} {u_out[73]} {u_out[74]} {u_out[75]} {u_out[76]} {u_out[77]} {u_out[78]} {u_out[79]} {u_out[80]} {u_out[81]} {u_out[82]} {u_out[83]} {u_out[84]} {u_out[85]} {u_out[86]} {u_out[87]} {u_out[88]} {u_out[89]} {u_out[90]} {u_out[91]} {u_out[92]} {u_out[93]} {u_out[94]} {u_out[95]} {u_out[96]} {u_out[97]} {u_out[98]} {u_out[99]} {u_out[100]} {u_out[101]} {u_out[102]} {u_out[103]} {u_out[104]} {u_out[105]} {u_out[106]} {u_out[107]} {u_out[108]} {u_out[109]} {u_out[110]} {u_out[111]} {u_out[112]} {u_out[113]} {u_out[114]} {u_out[115]} {u_out[116]} {u_out[117]} {u_out[118]} {u_out[119]} {u_out[120]} {u_out[121]} {u_out[122]} {u_out[123]} {u_out[124]} {u_out[125]} {u_out[126]} {u_out[127]}}
setPinAssignMode -pinEditInBatch true
editPin -pinWidth 0.07 -pinDepth 0.07 -fixOverlap 1 -unit MICRON -spreadDirection clockwise -side Right -layer 3 -spreadType center -spacing 0.57 -pin {{addr_rd_out[0]} {addr_rd_out[1]} {addr_rd_out[2]} {addr_rd_out[3]} {addr_rd_out[4]} {addr_rd_out[5]} {addr_rd_out[6]} {addr_rd_out[7]} {addr_rd_out[8]} {addr_rd_out[9]} {addr_rd_out[10]} {addr_rd_out[11]} {addr_rd_out[12]} {addr_rd_out[13]} {addr_rd_out[14]} {addr_rd_out[15]} {addr_rd_out[16]} {addr_rd_out[17]} {addr_rd_out[18]} {addr_rd_out[19]} {addr_rd_out[20]} {addr_rd_out[21]} {addr_rd_out[22]} {addr_rd_out[23]} {addr_rd_out[24]} {addr_rd_out[25]} {addr_rd_out[26]} {addr_rd_out[27]} {addr_rd_out[28]} {addr_rd_out[29]} {addr_rd_out[30]} {addr_rd_out[31]} {addr_rd_out[32]} {addr_rd_out[33]} {addr_rd_out[34]} {addr_rd_out[35]} {addr_rd_out[36]} {addr_rd_out[37]} {addr_rd_out[38]} {addr_rd_out[39]} {addr_rd_out[40]} {addr_rd_out[41]} {addr_rd_out[42]} {addr_rd_out[43]} {addr_rd_out[44]} {addr_rd_out[45]} {addr_rd_out[46]} {addr_rd_out[47]} {addr_rd_out[48]} {addr_rd_out[49]} {addr_rd_out[50]} {addr_rd_out[51]} {addr_rd_out[52]} {addr_rd_out[53]} {addr_rd_out[54]} {addr_rd_out[55]} {addr_rd_out[56]} {addr_rd_out[57]} {addr_rd_out[58]} {addr_rd_out[59]} {addr_rd_out[60]} {addr_rd_out[61]} {addr_rd_out[62]} {addr_rd_out[63]}}
setPinAssignMode -pinEditInBatch true
editPin -pinWidth 0.14 -pinDepth 0.14 -fixOverlap 1 -unit MICRON -spreadDirection clockwise -side Left -layer 2 -spreadType center -spacing 0.57 -pin {{n_out[0]} {n_out[1]} {n_out[2]} {n_out[3]} {n_out[4]} {n_out[5]} {n_out[6]} {n_out[7]} {n_out[8]} {n_out[9]} {n_out[10]} {n_out[11]} {n_out[12]} {n_out[13]} {n_out[14]} {n_out[15]} {n_out[16]} {n_out[17]} {n_out[18]} {n_out[19]} {n_out[20]} {n_out[21]} {n_out[22]} {n_out[23]} {n_out[24]} {n_out[25]} {n_out[26]} {n_out[27]} {n_out[28]} {n_out[29]} {n_out[30]} {n_out[31]} {n_out[32]} {n_out[33]} {n_out[34]} {n_out[35]} {n_out[36]} {n_out[37]} {n_out[38]} {n_out[39]} {n_out[40]} {n_out[41]} {n_out[42]} {n_out[43]} {n_out[44]} {n_out[45]} {n_out[46]} {n_out[47]} {n_out[48]} {n_out[49]} {n_out[50]} {n_out[51]} {n_out[52]} {n_out[53]} {n_out[54]} {n_out[55]} {n_out[56]} {n_out[57]} {n_out[58]} {n_out[59]} {n_out[60]} {n_out[61]} {n_out[62]} {n_out[63]} {n_out[64]} {n_out[65]} {n_out[66]} {n_out[67]} {n_out[68]} {n_out[69]} {n_out[70]} {n_out[71]} {n_out[72]} {n_out[73]} {n_out[74]} {n_out[75]} {n_out[76]} {n_out[77]} {n_out[78]} {n_out[79]} {n_out[80]} {n_out[81]} {n_out[82]} {n_out[83]} {n_out[84]} {n_out[85]} {n_out[86]} {n_out[87]} {n_out[88]} {n_out[89]} {n_out[90]} {n_out[91]} {n_out[92]} {n_out[93]} {n_out[94]} {n_out[95]} {n_out[96]} {n_out[97]} {n_out[98]} {n_out[99]} {n_out[100]} {n_out[101]} {n_out[102]} {n_out[103]} {n_out[104]} {n_out[105]} {n_out[106]} {n_out[107]} {n_out[108]} {n_out[109]} {n_out[110]} {n_out[111]} {n_out[112]} {n_out[113]} {n_out[114]} {n_out[115]} {n_out[116]} {n_out[117]} {n_out[118]} {n_out[119]} {n_out[120]} {n_out[121]} {n_out[122]} {n_out[123]} {n_out[124]} {n_out[125]} {n_out[126]} {n_out[127]}}
setPinAssignMode -pinEditInBatch true
editPin -pinWidth 0.14 -pinDepth 0.14 -fixOverlap 1 -unit MICRON -spreadDirection clockwise -side Right -layer 4 -spreadType center -spacing 0.57 -pin {{p[0]} {p[1]} {p[2]} {p[3]} {p[4]} {p[5]} {p[6]} {p[7]} {p[8]} {p[9]} {p[10]} {p[11]} {p[12]} {p[13]} {p[14]} {p[15]} {p[16]} {p[17]} {p[18]} {p[19]} {p[20]} {p[21]} {p[22]} {p[23]} {p[24]} {p[25]} {p[26]} {p[27]} {p[28]} {p[29]} {p[30]} {p[31]} {p[32]} {p[33]} {p[34]} {p[35]} {p[36]} {p[37]} {p[38]} {p[39]} {p[40]} {p[41]} {p[42]} {p[43]} {p[44]} {p[45]} {p[46]} {p[47]} {p[48]} {p[49]} {p[50]} {p[51]} {p[52]} {p[53]} {p[54]} {p[55]} {p[56]} {p[57]} {p[58]} {p[59]} {p[60]} {p[61]} {p[62]} {p[63]}}
setPinAssignMode -pinEditInBatch true
editPin -pinWidth 0.14 -pinDepth 0.14 -fixOverlap 1 -unit MICRON -spreadDirection clockwise -side Right -layer 4 -spreadType center -spacing 0.57 -pin {{p[0]} {p[1]} {p[2]} {p[3]} {p[4]} {p[5]} {p[6]} {p[7]} {p[8]} {p[9]} {p[10]} {p[11]} {p[12]} {p[13]} {p[14]} {p[15]} {p[16]} {p[17]} {p[18]} {p[19]} {p[20]} {p[21]} {p[22]} {p[23]} {p[24]} {p[25]} {p[26]} {p[27]} {p[28]} {p[29]} {p[30]} {p[31]} {p[32]} {p[33]} {p[34]} {p[35]} {p[36]} {p[37]} {p[38]} {p[39]} {p[40]} {p[41]} {p[42]} {p[43]} {p[44]} {p[45]} {p[46]} {p[47]} {p[48]} {p[49]} {p[50]} {p[51]} {p[52]} {p[53]} {p[54]} {p[55]} {p[56]} {p[57]} {p[58]} {p[59]} {p[60]} {p[61]} {p[62]} {p[63]}}
setPinAssignMode -pinEditInBatch true
editPin -pinWidth 0.14 -pinDepth 0.14 -fixOverlap 1 -unit MICRON -spreadDirection clockwise -side Right -layer 5 -spreadType center -spacing 0.57 -pin {{p[0]} {p[1]} {p[2]} {p[3]} {p[4]} {p[5]} {p[6]} {p[7]} {p[8]} {p[9]} {p[10]} {p[11]} {p[12]} {p[13]} {p[14]} {p[15]} {p[16]} {p[17]} {p[18]} {p[19]} {p[20]} {p[21]} {p[22]} {p[23]} {p[24]} {p[25]} {p[26]} {p[27]} {p[28]} {p[29]} {p[30]} {p[31]} {p[32]} {p[33]} {p[34]} {p[35]} {p[36]} {p[37]} {p[38]} {p[39]} {p[40]} {p[41]} {p[42]} {p[43]} {p[44]} {p[45]} {p[46]} {p[47]} {p[48]} {p[49]} {p[50]} {p[51]} {p[52]} {p[53]} {p[54]} {p[55]} {p[56]} {p[57]} {p[58]} {p[59]} {p[60]} {p[61]} {p[62]} {p[63]}}
setPinAssignMode -pinEditInBatch true
editPin -pinWidth 0.14 -pinDepth 0.14 -fixOverlap 1 -unit MICRON -spreadDirection clockwise -side Bottom -layer 2 -spreadType center -spacing 0.84 -pin {{u_out[0]} {u_out[1]} {u_out[2]} {u_out[3]} {u_out[4]} {u_out[5]} {u_out[6]} {u_out[7]} {u_out[8]} {u_out[9]} {u_out[10]} {u_out[11]} {u_out[12]} {u_out[13]} {u_out[14]} {u_out[15]} {u_out[16]} {u_out[17]} {u_out[18]} {u_out[19]} {u_out[20]} {u_out[21]} {u_out[22]} {u_out[23]} {u_out[24]} {u_out[25]} {u_out[26]} {u_out[27]} {u_out[28]} {u_out[29]} {u_out[30]} {u_out[31]} {u_out[32]} {u_out[33]} {u_out[34]} {u_out[35]} {u_out[36]} {u_out[37]} {u_out[38]} {u_out[39]} {u_out[40]} {u_out[41]} {u_out[42]} {u_out[43]} {u_out[44]} {u_out[45]} {u_out[46]} {u_out[47]} {u_out[48]} {u_out[49]} {u_out[50]} {u_out[51]} {u_out[52]} {u_out[53]} {u_out[54]} {u_out[55]} {u_out[56]} {u_out[57]} {u_out[58]} {u_out[59]} {u_out[60]} {u_out[61]} {u_out[62]} {u_out[63]} {u_out[64]} {u_out[65]} {u_out[66]} {u_out[67]} {u_out[68]} {u_out[69]} {u_out[70]} {u_out[71]} {u_out[72]} {u_out[73]} {u_out[74]} {u_out[75]} {u_out[76]} {u_out[77]} {u_out[78]} {u_out[79]} {u_out[80]} {u_out[81]} {u_out[82]} {u_out[83]} {u_out[84]} {u_out[85]} {u_out[86]} {u_out[87]} {u_out[88]} {u_out[89]} {u_out[90]} {u_out[91]} {u_out[92]} {u_out[93]} {u_out[94]} {u_out[95]} {u_out[96]} {u_out[97]} {u_out[98]} {u_out[99]} {u_out[100]} {u_out[101]} {u_out[102]} {u_out[103]} {u_out[104]} {u_out[105]} {u_out[106]} {u_out[107]} {u_out[108]} {u_out[109]} {u_out[110]} {u_out[111]} {u_out[112]} {u_out[113]} {u_out[114]} {u_out[115]} {u_out[116]} {u_out[117]} {u_out[118]} {u_out[119]} {u_out[120]} {u_out[121]} {u_out[122]} {u_out[123]} {u_out[124]} {u_out[125]} {u_out[126]} {u_out[127]}}
setPinAssignMode -pinEditInBatch true
editPin -use GROUND -pinWidth 0.8 -pinDepth 0.8 -fixOverlap 1 -unit MICRON -spreadDirection clockwise -side Bottom -layer 10 -spreadType center -spacing 0.14 -pin VSS
setPinAssignMode -pinEditInBatch true
editPin -use GROUND -pinWidth 0.8 -pinDepth 0.8 -fixOverlap 1 -unit MICRON -spreadDirection clockwise -side Top -layer 10 -spreadType center -spacing 0.14 -pin VSS
setPinAssignMode -pinEditInBatch true
editPin -use POWER -pinWidth 0.07 -pinDepth 0.07 -fixOverlap 1 -unit MICRON -spreadDirection clockwise -side Top -layer 1 -spreadType center -spacing 0.14 -pin VDD
setPinAssignMode -pinEditInBatch true
editPin -use GROUND -pinWidth 0.8 -pinDepth 0.8 -fixOverlap 1 -unit MICRON -spreadDirection clockwise -side Bottom -layer 10 -spreadType center -spacing 1.6 -pin VSS
setPinAssignMode -pinEditInBatch true
editPin -use GROUND -pinWidth 0.8 -pinDepth 0.8 -fixOverlap 1 -unit MICRON -spreadDirection clockwise -side Bottom -layer 10 -spreadType center -spacing 1.6 -pin VSS
setPinAssignMode -pinEditInBatch false
pan 260.877 202.671
pan -127.049 -38.330
getPinAssignMode -pinEditInBatch -quiet
globalNetConnect VDD -type pgpin -pin VDD -inst *
globalNetConnect VSS -type pgpin -pin VSS -inst *
globalNetConnect VDD -type tiehi
globalNetConnect VSS -type tielo
deselectAll
selectMarker 0.0000 -0.2900 274.5500 273.0000 -1 3 7
setLayerPreference allM0 -isVisible 1
setLayerPreference allM0 -isVisible 0
setLayerPreference allM0 -isVisible 1
setLayerPreference allM1 -isVisible 1
setLayerPreference allM2Cont -isVisible 1
setLayerPreference allM2 -isVisible 1
setLayerPreference allM3Cont -isVisible 1
setLayerPreference allM3 -isVisible 1
setLayerPreference allM4Cont -isVisible 1
setLayerPreference allM4 -isVisible 1
setLayerPreference allM5Cont -isVisible 1
setLayerPreference allM5 -isVisible 1
setLayerPreference allM6Cont -isVisible 1
setLayerPreference allM6 -isVisible 1
setLayerPreference allM7Cont -isVisible 1
setLayerPreference allM7 -isVisible 1
setLayerPreference allM8Cont -isVisible 1
setLayerPreference allM8 -isVisible 1
setLayerPreference allM9Cont -isVisible 1
setLayerPreference allM9 -isVisible 1
setLayerPreference allM10Cont -isVisible 1
setLayerPreference allM10 -isVisible 1
saveDesign Top.enc
saveDesign Top.enc
addRing -nets {VSS VDD} -type core_rings -follow io -layer {top metal5 bottom metal5 left metal4 right metal4} -width {top 1 bottom 1 left 1 right 1} -spacing {top 1 bottom 1 left 1 right 1} -offset {top 0 bottom 0 left 0 right 0} -center 0 -extend_corner {} -threshold 0 -jog_distance 0 -snap_wire_center_to_grid None
addStripe -block_ring_top_layer_limit metal5 -max_same_layer_jog_length 1.6 -padcore_ring_bottom_layer_limit metal3 -set_to_set_distance 5 -stacked_via_top_layer metal10 -padcore_ring_top_layer_limit metal5 -spacing 1 -xleft_offset 1 -merge_stripes_value 0.095 -layer metal4 -block_ring_bottom_layer_limit metal3 -width 1 -nets {VSS VDD} -stacked_via_bottom_layer metal1
sroute -connect { blockPin padPin padRing corePin floatingStripe } -layerChangeRange { 1 10 } -blockPinTarget {nearestRingStripe nearestTarget } -padPinPortConnect { allPort oneGeom } -checkAlignedSecondaryPin 1 -blockPin useLef -allowJogging 1 -crossoverViaBottomLayer 1 -allowLayerChange 1 -targetViaTopLayer 10 -crossoverViaTopLayer 10 -targetViaBottomLayer 1 -nets { VDD VSS }
saveDesign Top_power.enc
editPowerVia -skip_via_on_pin Standardcell -bottom_layer metal1 -add_vias 1 -top_layer metal8
setEndCapMode -reset
setEndCapMode -boundary_tap false
setPlaceMode -reset
setPlaceMode -congEffort auto -timingDriven 1 -modulePlan 1 -clkGateAware 1 -powerDriven 0 -ignoreScan 1 -reorderScan 1 -ignoreSpare 0 -placeIOPins 0 -moduleAwareSpare 0 -preserveRouting 0 -rmAffectedRouting 0 -checkRoute 0 -swapEEQ 0
setPlaceMode -fp false
placeDesign
timeDesign -preCTS -numPaths 200
floorPlan -r 1.0 0.6 2 2 2 2
uiSetTool select
getIoFlowFlag
globalNetConnect VDD -type pgpin -pin VDD -inst *
globalNetConnect VSS -type pgpin -pin VSS -inst *
globalNetConnect VDD -type tiehi
globalNetConnect VSS -type tielo
gui_select -rect {-131.082 244.552 -140.983 249.502}
pan -46.991 4.909
